{
  "status": "ok",
  "date_created": "2019-08-26T15:32:23-07:00",
  "date_updated": "2019-08-26T15:32:23-07:00",
  "id": 760,
  "title": "Some customers cannot create channels that contain a dash or an underscore in the name",
  "type": "incident",
  "url": "https://status.slack.com/2019-08/37d6093783d8527d",
  "services": [
    "Messaging",
    "Connections",
    "Posts/Files",
    "Notifications",
    "Login/SSO",
    "Workspace/Org Administration",
    "Link Previews",
    "Apps/Integrations/APIs",
    "Search"
  ],
  "notes": [
    {
      "date_created": "2019-08-29T22:06:31-07:00",
      "body": "Issue Summary:\r\n\r\nOn August 28, 2019 at 10:01 a.m. PDT a change was released which unexpectedly prevented some customers from being able to create channels. Specifically, if the channel name included a hyphen or underscore.\r\n\r\nAn update was made to ensure channel names with such characters were validated correctly, and by August 29 at 12:33 p.m. PDT channel creation was functioning as expected once again."
    },
    {
      "date_created": "2019-08-29T16:01:10-07:00",
      "body": "We’re happy to report that you should now be able to create channels that contain a hyphen or underscore in the name without any trouble! We apologize for the disruption."
    },
    {
      "date_created": "2019-08-29T12:21:12-07:00",
      "body": "We are still looking into channel name issues with channel creation but we hope we are nearing a fix. Thanks for your patience!"
    },
    {
      "date_created": "2019-08-29T11:46:36-07:00",
      "body": "We\u0027re seeing report of users having intermittent trouble with creating channel names. We\u0027re investigating and will follow up when we know more."
    },
    {
      "date_created": "2019-09-02T16:49:35-07:00",
      "body": "Issue Summary: \r\n\r\nOn August 30, 2019, beginning at 3:04 p.m. PDT, we received reports that some Enterprise Grid customers were unable to connect to Slack. Upon investigation, we identified that a large spike in requests was causing the symptoms of degraded access and degraded search in Slack. To fix the issue, we rolled back recent updates causing the increased load. The issue was fully resolved at 4:29 p.m. PDT."
    },
    {
      "date_created": "2019-08-30T16:32:16-07:00",
      "body": "We\u0027ve got good news: we\u0027re in the clear and everyone should be able to connect again. We\u0027re sorry for any trouble this caused. Thanks for sticking with us."
    },
    {
      "date_created": "2019-08-30T15:45:39-07:00",
      "body": "We\u0027re seeing some positive signs and people should be able to connect again. However, if you\u0027re still having issues, please let us know at feedback@slack.com."
    },
    {
      "date_created": "2019-08-30T15:30:40-07:00",
      "body": "We’ve heard reports that some people are experiencing degraded service or have trouble connecting to Slack. We\u0027re sorry for any disruption this has caused to your day."
    },
    {
      "date_created": "2019-08-30T15:24:21-07:00",
      "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
    },
    {
      "date_created": "2019-10-07T22:48:57-07:00",
      "body": "Issue Summary:\r\n\r\nOn October 7, 2019 at 6:36 p.m. PDT, we identified a change that inadvertently impacted the posts feature. As a result, customers were unable to open or create new posts in Slack. After reverting these changes, full functionality was restored to posts and the issue was resolved at 9:56 p.m. PDT."
    },
    {
      "date_created": "2019-10-07T21:56:30-07:00",
      "body": "We’ve restored the functionality to posts and things are back to normal. Sorry for the trouble, and thank you for your patience with us."
    },
    {
      "date_created": "2019-10-07T21:46:30-07:00",
      "body": "We’ve started to see improvements when creating and opening posts, but we’re still monitoring this closely. We’ll let you know when this feature has been completely restored."
    },
    {
      "date_created": "2019-10-07T21:10:35-07:00",
      "body": "We’re still looking into the issue with posts — we’ll provide new information as soon as it’s available. Thanks for bearing with us."
    },
    {
      "date_created": "2019-10-07T20:24:12-07:00",
      "body": "Some people are having trouble creating and opening posts. We’re currently investigating and will share more information as soon as we have an update. We\u0027re sorry for the disruption."
    },
    {
      "date_created": "2019-11-11T15:45:09-08:00",
      "body": "We are aware of an issue with Brazilian time zone settings that are affecting notifications, reminders, time stamps and other elements in Slack. Our engineers are coordinating to solve the issue. Thank you for your patience as we investigate!"
    },
    {
      "date_created": "2019-11-19T18:40:31-08:00",
      "body": "Some of our Enterprise Grid customers are having trouble accessing Slack workspaces in our desktop apps. We\u0027re currently looking into the cause, and we\u0027ll keep you posted as soon as we have more information. For those affected, access to Slack is still available through a web browser. We\u0027re sorry for the disruption to your day."
    },
    {
      "date_created": "2019-12-03T18:45:29-08:00",
      "body": "We\u0027re looking into reports of issues with creating posts for some Enterprise Grid customers. Thanks for your patience as we look into this."
    },
    {
      "date_created": "2019-12-09T16:49:34-08:00",
      "body": "Some customers may be experiencing server errors or messages failing to send in the desktop app. We\u0027re very sorry for the trouble and we\u0027re working to get things back to normal."
    },
    {
      "date_created": "2019-12-09T16:34:53-08:00",
      "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
    },
    {
      "date_created": "2019-12-09T21:47:58-08:00",
      "body": "Some customers may be experiencing issues configuring SAML SSO. We are investigating and we\u0027re very sorry for the disruption."
    },
    {
      "date_created": "2020-01-28T17:58:58-08:00",
      "body": "Some of our customers are having trouble inviting Guest accounts. In particular, this appears to be affecting our Enterprise Grid customers. We\u0027re currently investigating the cause and we\u0027ll keep you updated on new information. We\u0027re sorry for the disruption."
    },
    {
      "date_created": "2020-02-12T17:39:32-08:00",
      "body": "Google Drive thumbnails for new and recently uploaded files are now visible in Slack. We\u0027ll be back with an update on the thumbnails that are still missing. Thanks for your patience."
    },
    {
      "date_created": "2020-02-12T14:26:29-08:00",
      "body": "Google Drive thumbnails aren\u0027t displaying in Slack. We\u0027re sorry for the trouble, and we\u0027ll keep you posted here."
    },
    {
      "date_created": "2020-03-06T15:11:57-08:00",
      "body": "We’re glad to report all issues with the Admin stats page and Workspace Directory have been resolved. Apologies for the disruption we caused, and thank you for your patience."
    },
    {
      "date_created": "2020-03-06T14:48:11-08:00",
      "body": "We’re investigating issues with the Admin stats page and Workspace Directory for Grid customers. We’re looking into the cause and will provide new information as soon as it’s available."
    },
    {
      "date_created": "2020-03-06T14:40:45-08:00",
      "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
    },
    {
      "date_created": "2020-03-12T22:17:04-07:00",
      "body": "We are working hard to identify the cause of the issue. We will be back with more information in 30 minutes."
    },
    {
      "date_created": "2020-03-12T21:46:04-07:00",
      "body": "Some customers may be having trouble loading Slack or parts of the Slack interface. We\u0027re very sorry for the disruption and we have all hands on deck as we investigate. Thank you for bearing with us."
    },
    {
      "date_created": "2020-03-13T15:58:47-07:00",
      "body": "We’ve resolved the issue with some features failing to load and Slack is back to full functionality. We’re sorry for the disruption this has caused."
    },
    {
      "date_created": "2020-03-13T12:51:28-07:00",
      "body": "Our team continues to work to get full functionality restored as soon as possible. No additional information to share just yet, but we’ll keep you posted as soon we have an update."
    },
    {
      "date_created": "2020-03-13T11:49:20-07:00",
      "body": "We\u0027re continuing to look into this issue and work towards a fix. Thank you again for bearing with us in the meantime."
    },
    {
      "date_created": "2020-03-13T10:47:30-07:00",
      "body": "Upon further investigation, we\u0027ve also found that this issue may be causing issues with installing apps or integrations in Slack. We\u0027ll continue to keep you in the loop as more information becomes available."
    },
    {
      "date_created": "2020-03-13T10:07:34-07:00",
      "body": "We\u0027re still hard at work investigating a fix for this issue. We\u0027re sorry about the continued trouble and we\u0027ll let you know once we have more information to share."
    },
    {
      "date_created": "2020-03-13T09:34:42-07:00",
      "body": "Some users may be experiencing issues with various features in Slack, including app, channel, and user names not displaying as expected. We\u0027re aware of the source of the issue, and we have a team of engineers dedicated to fixing this as soon as possible. We\u0027ll keep you posted as we make progress towards a fix."
    },
    {
      "date_created": "2020-03-13T09:07:32-07:00",
      "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
    },
    {
      "date_created": "2020-03-24T17:18:02-07:00",
      "body": "We\u0027re looking into reports of access issues for some people using web browsers. Please hold tight. In the meantime, using a different type of web browser or the desktop app will hopefully get you back into your workspace."
    },
    {
      "date_created": "2020-03-30T19:11:11-07:00",
      "body": "Issue Summary: \r\n\r\nOn March 30, 2020 from 3:20 p.m. to 6:26 p.m. PDT, some customers may have experienced elevated API response times or timeouts. This was caused by an issue with a third-party provider. Once they resolved the issue, Slack API response times returned to normal."
    },
    {
      "date_created": "2020-03-30T18:36:12-07:00",
      "body": "Customers should no longer be experiencing elevated API response times or timeouts. Thank you for being patient with us, we appreciate it. \r\n\r\nIf you have any further issues, please reach out to us at feedback@slack.com."
    },
    {
      "date_created": "2020-03-30T17:38:55-07:00",
      "body": "Issues with a third-party provider are causing elevated response times in the API, leading to potential timeouts. We are monitoring the situation and working to mitigate this from our end as best we can. We apologize for the disruption."
    },
    {
      "date_created": "2020-04-02T18:24:03-07:00",
      "body": "We’re still investigating the issue with these delayed or failed actions, and we\u0027ve discovered that this may be affecting searching in Slack as well. We\u0027ll confirm as soon as things are working as they should be."
    },
    {
      "date_created": "2020-04-02T17:49:13-07:00",
      "body": "Some of our customers are having trouble completing certain user-related actions, such as when deactivating members. We\u0027re currently investigating the cause of these delays, and we\u0027ll keep you posted as soon as we have more information. We\u0027re sorry for the disruption."
    },
    {
      "date_created": "2020-04-14T17:50:51-07:00",
      "body": "We\u0027ve been seeing improvements to the performance of accounts with Enterprise Key Management enabled though we are still investigating the root cause. Thank you for your patience as we get to the bottom of this."
    },
    {
      "date_created": "2020-04-14T16:30:09-07:00",
      "body": "Some customers with Enterprise Key Management enabled may be experiencing issues when trying to read or write messages. We’re looking into it and will provide another update as soon as it’s available."
    },
    {
      "date_created": "2020-04-14T16:20:31-07:00",
      "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
    },
    {
      "date_created": "2020-04-24T17:56:21-07:00",
      "body": "We have resolved the issue and everyone should be able to connect to Slack once more. We\u0027re very sorry for the disruption and we appreciate you bearing with us."
    },
    {
      "date_created": "2020-04-24T16:42:42-07:00",
      "body": "Users should start to see improvements and be able to connect again. We will provide another update as soon as the issue is fully resolved. Thank you for your patience."
    },
    {
      "date_created": "2020-04-24T15:36:33-07:00",
      "body": "Upon further investigation this issue is not exclusive to Android devices. Some users are unable to automatically receive new messages and may notice a grey banner on desktop. We’ll provide an update as soon as it’s available."
    },
    {
      "date_created": "2020-04-24T15:06:02-07:00",
      "body": "Some Android users have reported difficulty logging into Slack. We are investigating and will provide an update as soon as we know more."
    },
    {
      "date_created": "2020-04-24T14:59:53-07:00",
      "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
    },
    {
      "date_created": "2020-04-30T10:49:51-07:00",
      "body": "Information on the Analytics dashboard (https://my.slack.com/stats) is not up to date. We are currently investigating this issue and will be back as soon as we have more news to share. We\u0027re sorry for any inconvenience caused in the meantime."
    },
    {
      "date_created": "2020-05-26T14:20:09-07:00",
      "body": "We\u0027re still working towards a solution for this issue. We\u0027ll return back here with an update when we have more news to share on a fix."
    },
    {
      "date_created": "2020-05-26T12:49:00-07:00",
      "body": "We\u0027ve identified the likely cause of this issue and we\u0027re now exploring possible fixes. Thank you for your continued patience as we work to get things fixed up."
    },
    {
      "date_created": "2020-05-26T11:49:48-07:00",
      "body": "We\u0027re continuing to look into the issue causing custom emoji to not appear for some customers. We\u0027re sorry for the trouble and will continue to keep you posted."
    },
    {
      "date_created": "2020-05-26T11:19:03-07:00",
      "body": "Our team is investigating an issue that is causing custom emoji to go missing from some workspaces. We\u0027ll keep you updated as soon as we have more information."
    },
    {
      "date_created": "2020-06-01T11:23:40-07:00",
      "body": "Some Android users may notice that new messages are not showing up in channels and DMs immediately. We\u0027re actively investigating this issue and will keep you posted as more information becomes available. For now, quitting and reopening the Slack app should allow new messages to load. We\u0027re sorry for any disruption this brings to your day."
    },
    {
      "date_created": "2020-06-11T05:55:18-07:00",
      "body": "We\u0027re investigating problems with search indexing. In the meantime, people might notice some messages and files not showing up in search results. We apologize for the inconvenience."
    },
    {
      "date_created": "2020-07-30T15:12:34-07:00",
      "body": "Some users might notice that their notifications settings for mobile are not being respected. We are taking a look and hope to have more news soon."
    },
    {
      "date_created": "2020-07-24T10:45:08-07:00",
      "body": "We\u0027re currently aware of some intermittent latency and timeouts with image attachments, certain API methods (including users.setPhoto, chat.postMessage and chat.update, views.*), and apps which use these features. We are currently investigating and will update when we believe these issues have been resolved. Sorry for the inconvenience."
    },
    {
      "date_created": "2020-08-06T14:52:25-07:00",
      "body": "Some users and app developers are currently seeing \"Request failed with status code 400\" errors when apps submit requests.  We are looking into this and will post when we have more information."
    },
    {
      "date_created": "2020-08-07T15:34:00-07:00",
      "body": "We\u0027ve determined this issue is only impacting confirmation emails sent after clicking an invite link to join a workspace, while other emails are working as intended. We\u0027ll continue to keep you posted as we work towards a fix. \r\n\r\nFor now, we recommend sending invitations directly via email, rather than sharing invite links with invitees."
    },
    {
      "date_created": "2020-08-07T15:04:31-07:00",
      "body": "Some customers may be unable to receive emails from Slack. We\u0027re currently investigating this issue, and we\u0027ll let you know as soon as we have more information. We apologize for the inconvenience in the meantime."
    },
    {
      "date_created": "2020-08-20T10:50:22-07:00",
      "body": "We\u0027ve received some reports of folks being suddenly signed out of Slack on desktop, and we\u0027re investigating this issue further. We apologize for any disruption this may have caused and will let you know once we have more details."
    },
    {
      "date_created": "2020-09-09T14:23:48-07:00",
      "body": "Some users are unable to sign in to Slack using Google SSO. This issue appears to be isolated to desktop at this time. We\u0027re working to get things back to normal as quickly as possible, and we apologize for the disruption."
    },
    {
      "date_created": "2020-09-10T16:47:57-07:00",
      "body": "Issue Summary:\r\nFrom September 8, 2020 at 7:33 p.m. PDT until September 10, 2020 at 11:59 p.m. PDT, some customers saw a “Page not available” error message when trying to sign into Slack using Google Auth SSO.\r\n\r\nUpon investigation, we identified an error in an update we made to how we handle SSO authentication errors. We reverted the change which resolved the issue for all affected users."
    },
    {
      "date_created": "2020-09-10T15:23:49-07:00",
      "body": "We\u0027ve restored full functionality so that anyone using Google SSO to login to Slack should now be able to successfully access their Slack workspace(s). If you continue to have issues signing in with Google SSO, please let us know at feedback@slack.com. \r\n\r\nWe appreciate you bearing with us and our sincere apologies for any inconvenience this caused."
    },
    {
      "date_created": "2020-09-09T19:03:10-07:00",
      "body": "We\u0027ve identified the problem and made a fix that we expect to resolve this issue. We are seeing steady improvements, but we\u0027re continuing to monitor this closely as a small number of customers may still be encountering trouble signing in to Slack using Google SSO at the moment.\r\n\r\nWe\u0027ll be back with an update once we can confirm the issue is fully resolved."
    }
  ]
}