[
  {
    "id": 756,
    "date_created": "2019-08-23T10:53:23-07:00",
    "date_updated": "2019-08-26T15:32:23-07:00",
    "title": "DMs and starred channels missing from sidebar",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/70a3ef71bed2a028",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-08-26T15:32:23-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 23, 2019 at 10:50 a.m. PDT, some customers reported seeing issues with their direct messages (DMs) not showing on the sidebar in their workspace.\r\n\r\nOur team investigated and discovered that a recently deployed code change meant to prevent redundant loading of member data caused a regression. This resulted in Slack not fetching the necessary member data to show DMs in the sidebar.\r\n\r\nOur team was then able to remedy the initial code change, resolving the issue for all customers on August 23, 2019 at 4:05 p.m. PDT."
      },
      {
        "date_created": "2019-08-23T16:05:24-07:00",
        "body": "We have identified the issue causing DMs be removed from the sidebar, and we have rolled out a fix. Clearing your cache and refreshing should solve this issue.\r\n\r\nStars missing from the sidebar has been identified as an iOS bug. Anyone who wrote in about this issue will be contacted when we\u0027ve resolved the bug. \r\n\r\nThanks for your patience!"
      },
      {
        "date_created": "2019-08-23T14:28:42-07:00",
        "body": "We\u0027re afraid we have no updates for now, though our team is actively investigating this issue. We will post again once we have new news to share. Thank you for your patience!"
      },
      {
        "date_created": "2019-08-23T13:56:22-07:00",
        "body": "Apologies for the continued sidebar issues. We are still diligently investigating."
      },
      {
        "date_created": "2019-08-23T13:24:57-07:00",
        "body": "We\u0027re still actively pursuing what might be causing this. Thanks again for sticking with us!"
      },
      {
        "date_created": "2019-08-23T12:53:03-07:00",
        "body": "We\u0027re still digging into this issue, and will share updates as they become available. Thank you again for bearing with us in the meantime."
      },
      {
        "date_created": "2019-08-23T12:24:37-07:00",
        "body": "Still no news to share, but we\u0027re working hard to identify how to get this one fixed. We\u0027ll let you know once more details are available."
      },
      {
        "date_created": "2019-08-23T11:53:27-07:00",
        "body": "We still haven\u0027t gotten to the bottom of this issue, but are continuing to investigate. We\u0027re sorry for any inconvenience caused in the meantime."
      },
      {
        "date_created": "2019-08-23T11:25:03-07:00",
        "body": "We\u0027re still looking into why starred channels and DMs may not be appearing in the sidebar. For now, these conversations are still accessible via search and keyboard shortcuts. We\u0027ll continue to keep you posted as more news becomes available."
      },
      {
        "date_created": "2019-08-23T10:53:23-07:00",
        "body": "Some customers may be noticing that DMs and starred channels are not showing in their sidebars. We\u0027re currently investigating and will be back once we have more info. Thanks for your patience in the meantime."
      }
    ]
  },
  {
    "id": 757,
    "date_created": "2019-08-26T10:08:22-07:00",
    "date_updated": "2019-08-26T11:39:22-07:00",
    "title": "Issues loading the \"Manage members\" page",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/9b04fe0eaf2c25e3",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-08-26T11:39:22-07:00",
        "body": "We\u0027re pleased to report that the \"Manage members\" page should load after reloading (Ctrl/Cmd + R). Thank you again for hanging tight while we worked on clearing this issue up."
      },
      {
        "date_created": "2019-08-26T11:09:03-07:00",
        "body": "Nothing new to share just yet, but we\u0027re continuing to investigate. Thanks for bearing with us for now."
      },
      {
        "date_created": "2019-08-26T10:44:05-07:00",
        "body": "We\u0027re still investigating the issue affecting the \"Manage members\" page. We\u0027ll continue to keep you posted as more info becomes available."
      },
      {
        "date_created": "2019-08-26T10:08:22-07:00",
        "body": "Some folks may be having trouble viewing their team members on the \"Manage members\" page. We\u0027re looking into this and will report back once we have more news to share. Apologies for any inconvenience in the meantime."
      }
    ]
  },
  {
    "id": 755,
    "date_created": "2019-08-22T12:08:00-07:00",
    "date_updated": "2019-08-23T09:06:57-07:00",
    "title": "Trouble with contact forms on our website",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/8559e1e30c016134",
    "services": [],
    "notes": [
      {
        "date_created": "2019-08-23T09:06:57-07:00",
        "body": "On August 22, 2019 at 10:09 a.m. PDT, we deployed a code change that resulted in all forms on our website being unusable for customers. This included the \"Contact Us\" form and the sign up form, among others.\r\nOur team became aware of the issue and reverted the previous code change resolving the issue on August 23, 2019 at 12:47 PDT."
      },
      {
        "date_created": "2019-08-22T12:49:50-07:00",
        "body": "We have resolved the issue affecting forms on our website. Thank you for bearing with us while we got a fix in place, and apologies again for the interruption."
      },
      {
        "date_created": "2019-08-22T12:08:00-07:00",
        "body": "People are unable to contact us through the forms on our website. We\u0027re working to resolve this, and we\u0027re sorry for the trouble. In the meantime, please contact feedback@slack.com directly."
      }
    ]
  },
  {
    "id": 750,
    "date_created": "2019-08-16T09:31:50-07:00",
    "date_updated": "2019-08-21T16:53:18-07:00",
    "title": "Trouble searching, mentioning, and messaging team members for some Grid customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/dd0c587a51c32cba",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-08-21T16:53:18-07:00",
        "body": "On August 16, 2019 at 5:25 a.m. PDT, we received a report that some Enterprise Grid users were unable to open a direct message, use the Quick Switcher or mention a team member in Slack. We identified that it was affecting a small number of customers who used the shared channels beta on their workspaces prior to migrating those workspaces to the same Enterprise Grid organization.\r\n\r\nDue to a code change, we erroneously classified some users as being users from other external organizations. This is why those users could not be direct messaged or mentioned. We deployed a fix and by 12:17 p.m. PDT on August 21, 2019, the issue was fully resolved."
      },
      {
        "date_created": "2019-08-21T12:56:18-07:00",
        "body": "We now have the all-clear for this issue. We appreciate your patience while we confirmed these fixes, and apologize for any disruption to your day."
      },
      {
        "date_created": "2019-08-21T00:12:11-07:00",
        "body": "We have now pushed a fix for these issues Enterprise Grid members were experiencing though we will be monitoring things before we call an all-clear. Please let us know at feedback@slack.com if you continue to see issues with mentioning, searching, and messaging other members. \r\n\r\nFor anyone experiencing these issues on a mobile device, please perform a cache clear to receive this fix: Settings \u003e Advanced \u003e Reset cache."
      },
      {
        "date_created": "2019-08-16T16:46:12-07:00",
        "body": "We\u0027re continuing to investigate users on Enterprise Grid who are unable to mention, search and direct messages some members. We appreciate your patience and we will provide an update once it is resolved."
      },
      {
        "date_created": "2019-08-16T09:31:50-07:00",
        "body": "Some people may be having trouble searching for teammates. We’re currently investigating and will let you know once we have more news to share. Thanks for your patience in the meantime."
      }
    ]
  },
  {
    "id": 754,
    "date_created": "2019-08-20T18:01:19-07:00",
    "date_updated": "2019-08-20T23:46:32-07:00",
    "title": "Customers unable to access context menu on Admin page under certain resolutions.",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/7a9cb02c02638f87",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-08-20T23:46:32-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 20, 2019, beginning at 5:22 p.m. PDT, some customers reported not being able to access the context menu on the Admin page. After some investigation, it was discovered that a change to the padding and layout of the Admin page meant some customers had trouble accessing the context menu on this page under certain resolutions.\r\n\r\nBy 10:35 p.m. PDT, the issue was resolved for all resolutions and customers were able to access the context menu again."
      },
      {
        "date_created": "2019-08-20T22:15:47-07:00",
        "body": "We’re happy to report that the issues with accessing the context menu on the Admin page have now been fixed. There are other elements on the same page that we are still working to align correctly. Please reach out to feedback@slack.com for more information on this effort. To those affected, we’re so sorry for the disruption to your day. Thanks for sticking with us on that."
      },
      {
        "date_created": "2019-08-20T20:17:44-07:00",
        "body": "We believe we\u0027ve found the issue’s root cause and are working hard to get things back up and running. Thanks for bearing with us."
      },
      {
        "date_created": "2019-08-20T19:06:32-07:00",
        "body": "We\u0027re still trying to pin down the root cause of this context menu issue. We hope to bring some good news soon."
      },
      {
        "date_created": "2019-08-20T18:34:31-07:00",
        "body": "We have no new information to share just yet, but we\u0027re continuing our efforts. Thanks for your patience here."
      },
      {
        "date_created": "2019-08-20T18:01:19-07:00",
        "body": "Some people may be having issues with accessing the context menu on their Admin page under certain resolutions. We’re working on getting this sorted swiftly.\r\n\r\nIn the meantime, you should be able to work around this by adjusting the window size to smaller than 1473px by using the keyboard shortcut Cmd/Ctrl and \"-\" or larger than 1580px with the keyboard shortcut Cmd/Ctrl and \"+\"."
      }
    ]
  },
  {
    "id": 753,
    "date_created": "2019-08-20T06:01:14-07:00",
    "date_updated": "2019-08-20T17:22:43-07:00",
    "title": "Problems with Search and the Workspace Admin Dashboard",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/cd1717a3c6cd6d4b",
    "services": [
      "Search",
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-08-20T17:22:43-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 20, 2019, beginning at 4:30 a.m. PDT, some customers started to experience degraded search functionality. It was then discovered that an internal script making administrative changes was causing pressure on one of our processes that relates to the search feature. Once this was discovered, this internal script was turned off and the process was restarted which resulted in search being fully restored by 7:04 a.m. PDT."
      },
      {
        "date_created": "2019-08-20T07:14:26-07:00",
        "body": "Customers affected by intermittent failures when searching should no longer be having trouble. We\u0027ve rolled out a fix and have confirmed that Search is back to normal. Sorry for the hassle while we sorted this out."
      },
      {
        "date_created": "2019-08-20T06:44:26-07:00",
        "body": "We are continuing to monitor issues with Search and the Admin page for Enterprise Grid workspaces. We are looking into possible solutions and will share an update shortly."
      },
      {
        "date_created": "2019-08-20T06:14:26-07:00",
        "body": "Users are facing intermittent failures when searching for members and channels in their workspace. Additionally, the same root cause is resulting in member changes not reflecting on the Admin page for Enterprise Grid workspaces."
      },
      {
        "date_created": "2019-08-20T06:01:14-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 752,
    "date_created": "2019-08-20T02:47:00-07:00",
    "date_updated": "2019-08-20T16:58:22-07:00",
    "title": "Problems with Search",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/25ef0012d2d145b6",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-08-20T16:58:22-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 20, 2019, starting at 2:25 a.m. PDT, we began encountering issues with how we store some language-specific content in search. The issues caused some search queries to fail for some customers. To resolve the issue, we identified a problematic indexing process and restarted it. Search was fully recovered by 4:12 a.m. PDT."
      },
      {
        "date_created": "2019-08-20T04:13:30-07:00",
        "body": "The problems users were experiencing with search have now been resolved. Thank you for your patience while we worked through this."
      },
      {
        "date_created": "2019-08-20T03:50:54-07:00",
        "body": "While search is now returning results successfully, it is worth noting that new messages will not be shown in these results. We are continuing to work on improvements."
      },
      {
        "date_created": "2019-08-20T03:20:05-07:00",
        "body": "We are making positive progress, and it seems that search should be working as expected for most users. Once we are confident that a full fix is in place, we will share this news."
      },
      {
        "date_created": "2019-08-20T02:50:12-07:00",
        "body": "Some users may be experiencing difficulty searching in Slack. We are investigating the cause, and will update with news as we have it. Apologies for any inconvenience."
      },
      {
        "date_created": "2019-08-20T02:47:00-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 751,
    "date_created": "2019-08-19T12:53:28-07:00",
    "date_updated": "2019-08-19T17:32:23-07:00",
    "title": "Trouble authenticating through Google",
    "type": "notice",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/9f3295009efe3d32",
    "services": [
      "Login/SSO"
    ],
    "notes": [
      {
        "date_created": "2019-08-19T17:32:23-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 19, 2019, we became aware that Google was investigating an issue with authentication. During this time, some users were unable to sign in to Slack using their Google credentials. At 12:30 p.m. PDT, Google resolved the issue for all users."
      },
      {
        "date_created": "2019-08-19T13:40:50-07:00",
        "body": "All customers should be able to sign into Slack through Google once again. We appreciate you standing by in the meantime, and apologize for any disruption caused here."
      },
      {
        "date_created": "2019-08-19T12:53:28-07:00",
        "body": "Some people are having trouble authenticating with Google. We\u0027re tracking this issue and will be back with more updates once we have more news. Thanks for hanging tight in the meantime."
      }
    ]
  },
  {
    "id": 749,
    "date_created": "2019-08-16T07:45:52-07:00",
    "date_updated": "2019-08-16T16:53:12-07:00",
    "title": "Intermittent issues with Search function",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/f910752599b0bb44",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-08-16T16:53:12-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 16, 2019 at 7:13 a.m. PDT, a significant spike in search requests caused the server to overload. This caused search to fail for all users. Upon investigation, we identified the root cause and moved the traffic to other services to process the search requests. We fully resolved the issue at 1:05 p.m. PDT."
      },
      {
        "date_created": "2019-08-16T14:10:38-07:00",
        "body": "We\u0027re pleased to report that these intermittent issues with search are now resolved. Thanks for bearing with us while we worked to get things fixed up."
      },
      {
        "date_created": "2019-08-16T09:15:52-07:00",
        "body": "Our team has found the cause of the issue and are working to get things back to normal as soon as possible."
      },
      {
        "date_created": "2019-08-16T08:15:52-07:00",
        "body": "We haven\u0027t yet nailed down the cause of the issue. We\u0027ll continue to update you with our progress."
      },
      {
        "date_created": "2019-08-16T07:45:52-07:00",
        "body": "Some people are experiencing issues with our Search function. Our team is working to resolve the issue. Thanks for your patience."
      }
    ]
  },
  {
    "id": 747,
    "date_created": "2019-08-14T16:09:37-07:00",
    "date_updated": "2019-08-15T19:33:16-07:00",
    "title": "Slash commands are failing for some apps",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/4ee2b833e7eecd9a",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-08-15T19:33:16-07:00",
        "body": "Issue Summary:\r\n\r\nAt 3:47 p.m. PDT on August 14, 2019, we started receiving reports that some app slash commands were suddenly failing. This was due to a code deploy earlier that day which prevented these slash commands from responding as expected. We reverted the changes to restore functionality, and the issue was resolved at 5:24 p.m. PDT."
      },
      {
        "date_created": "2019-08-14T17:45:47-07:00",
        "body": "We have resolved the slash command problem, and all slash commands should be working smoothly once again. We\u0027re very sorry for the disruption. Thank you for bearing with us."
      },
      {
        "date_created": "2019-08-14T16:09:37-07:00",
        "body": "Some people may be experiencing issues when using slash commands. Thank you for your patience as we look into this, and we\u0027ll let you know once we have an update to share."
      }
    ]
  },
  {
    "id": 748,
    "date_created": "2019-08-14T16:20:11-07:00",
    "date_updated": "2019-08-15T19:30:32-07:00",
    "title": "Issues with search for some customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/72ec4a58d9baff31",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-08-15T19:30:32-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 14, 2019 at 1:30 p.m. PDT, we kicked off a new process for our search data which caused unexpected stress across our search systems. In order to rectify the issues we paused specific functions in search, which caused failed searches for all users.\r\n\r\nOur team quickly narrowed down the issue and managed the stress of our search servers until we were confident our servers were not being overwhelmed further. We called an All Clear at 8:06 p.m. PDT."
      },
      {
        "date_created": "2019-08-14T20:14:18-07:00",
        "body": "Full search functionality has been restored and everything should be back to normal. We\u0027re very sorry for the disruption. We\u0027ll report back with an Issue Summary."
      },
      {
        "date_created": "2019-08-14T19:36:18-07:00",
        "body": "We\u0027re still all hands on deck as we work to set search to rights. Thank you for your patience."
      },
      {
        "date_created": "2019-08-14T19:06:24-07:00",
        "body": "No additional news to share just yet. We\u0027re focused on getting things back to normal as quickly as we can."
      },
      {
        "date_created": "2019-08-14T18:33:19-07:00",
        "body": "We\u0027re still working to restore full functionality, and we\u0027ll be back with more information soon."
      },
      {
        "date_created": "2019-08-14T17:58:56-07:00",
        "body": "We\u0027re seeing some improvements, but we\u0027re not out of the woods quite yet. We\u0027re actively working to restore full search functionality, and we\u0027ll share more news shortly."
      },
      {
        "date_created": "2019-08-14T17:25:16-07:00",
        "body": "We\u0027re still tackling the search issues, but we don\u0027t have any additional information just yet. Thank you for bearing with us."
      },
      {
        "date_created": "2019-08-14T16:54:29-07:00",
        "body": "We are continuing to look into the issues with search at this time. If you are affected, we do apologize for the trouble. We will be back again soon with a further update."
      },
      {
        "date_created": "2019-08-14T16:20:11-07:00",
        "body": "We are investigating reports of searches failing for some customers. We will report back here once we have more information. If you\u0027re affected, we truly apologize for the disruption."
      }
    ]
  },
  {
    "id": 746,
    "date_created": "2019-08-07T14:53:11-07:00",
    "date_updated": "2019-08-08T17:05:33-07:00",
    "title": "Connectivity issues for some workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/28217646f99843b9",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-08-08T17:05:33-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 7, 2019 at 2:16 p.m. PDT, one of our servers received a large number of requests, resulting in Slack being unavailable to customers whose workspaces were hosted on that server. The server recovered from this traffic at 3:59 p.m. PDT, restoring service to the affected workspaces."
      },
      {
        "date_created": "2019-08-07T16:20:53-07:00",
        "body": "Customers may find that they can connect again now, although we are still working on ensuring this issue is fully resolved. We will come back and update here once we have that all clear."
      },
      {
        "date_created": "2019-08-07T15:59:40-07:00",
        "body": "Thank you for your continued patience as we look into a fix for this issue. We do apologize for the disruption to your day, and hope to have things back to normal soon."
      },
      {
        "date_created": "2019-08-07T15:30:35-07:00",
        "body": "We are continuing to look into connection problems that some workspaces are seeing. Thank you for your patience as we do so. We will update here as soon as there has been any change in status."
      },
      {
        "date_created": "2019-08-07T15:03:00-07:00",
        "body": "We have found that some workspaces are facing connectivity issues. We are investigating at the moment and will share more information as soon as we have it."
      },
      {
        "date_created": "2019-08-07T14:53:11-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 745,
    "date_created": "2019-08-07T08:02:41-07:00",
    "date_updated": "2019-08-07T12:35:18-07:00",
    "title": "Degraded performance with files unfurling and search results for files",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/718abe891e2a9d35",
    "services": [
      "Posts/Files",
      "Search",
      "Link Previews"
    ],
    "notes": [
      {
        "date_created": "2019-08-07T12:35:18-07:00",
        "body": "We have a fix in place for this issue, so all affected customers should now be seeing file search and unfurling working properly. Thanks for your patience and apologies for any interruption to your day."
      },
      {
        "date_created": "2019-08-07T11:38:21-07:00",
        "body": "We\u0027re seeing some signs of improvement, but aren\u0027t out of the woods just yet. We\u0027ll continue to update you as we make progress towards a resolution."
      },
      {
        "date_created": "2019-08-07T10:40:03-07:00",
        "body": "We\u0027re continuing our investigation of this issue, and will keep you posted as more information becomes available. Thanks again for bearing with us."
      },
      {
        "date_created": "2019-08-07T09:38:41-07:00",
        "body": "We don\u0027t have additional news to share just yet, but we’re focused on getting things back to normal as quickly as we can.  Thank you for sticking with us in the meantime."
      },
      {
        "date_created": "2019-08-07T09:08:41-07:00",
        "body": "We’re still working to fix issues with the unfurling and search results of files. We don\u0027t have new information to share just yet, but we’ll keep you updated on our progress."
      },
      {
        "date_created": "2019-08-07T08:38:41-07:00",
        "body": "We’re continuing to isolate the problem and get everything back to full functionality. We hope to have a fix rolled out as soon as possible."
      },
      {
        "date_created": "2019-08-07T08:08:41-07:00",
        "body": "Some customers may be experiencing issues with files unfurling and search results for files. We\u0027re investigating the cause and will report back once we have an update to share."
      },
      {
        "date_created": "2019-08-07T08:02:41-07:00",
        "body": "Teams may be experiencing issues with files unfurling and search indexing. We\u0027re investigating the cause and will report back once we have an update to share."
      }
    ]
  },
  {
    "id": 744,
    "date_created": "2019-08-05T11:13:01-07:00",
    "date_updated": "2019-08-05T18:37:50-07:00",
    "title": "Mentions in messages not working for Enterprise Grid workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/c5a1eae60fc6c346",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-08-05T18:37:50-07:00",
        "body": "Issue Summary:\r\n\r\nOn August 5th starting at 9:57 a.m. PDT, we received reports that some Enterprise Grid customers were unable to mention team members. This was due to an earlier issue we had thought to be resolved on August 2nd at 3:55 p.m. PDT after we reverted the update that caused it.\r\n\r\nThis didn\u0027t resolve it for all affected customers though, so our team then deployed a fix and the issue was resolved for all customers on August 5th at 2:27 p.m. PDT."
      },
      {
        "date_created": "2019-08-05T12:15:32-07:00",
        "body": "Tagging teammates in messages is working once again. If you\u0027re experiencing any trouble here, reload Slack using Cmd/Ctrl + R and you should see an improvement. Sorry for the disruption and thank you for bearing with us."
      },
      {
        "date_created": "2019-08-05T11:13:01-07:00",
        "body": "We\u0027re investigating reports of autocomplete not tagging users properly in Enterprise Grid workspaces. Our team is looking into it and we\u0027ll share more as soon as we can."
      }
    ]
  },
  {
    "id": 743,
    "date_created": "2019-08-02T11:35:58-07:00",
    "date_updated": "2019-08-02T16:38:55-07:00",
    "title": "Mentions in shared channels not working for Enterprise Grid workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/d0891ced70177790",
    "services": [
      "Messaging",
      "Notifications"
    ],
    "notes": [
      {
        "date_created": "2019-08-02T16:38:55-07:00",
        "body": "On August 1, 2019 starting at 11:00 p.m. PDT, we received reports that some Enterprise Grid customers were unable to mention team members. Upon investigation, we identified that a backend update to the search feature caused some team members not to appear in the autocomplete. We reverted the update and the issue was fully resolved on August 2, 2019 at 3:55 p.m. PDT."
      },
      {
        "date_created": "2019-08-02T16:06:56-07:00",
        "body": "We\u0027re happy to report that we’ve resolved the issue, Enterprise Grid users can once again mention teammates in shared channels. Apologies for the inconvenience."
      },
      {
        "date_created": "2019-08-02T11:35:58-07:00",
        "body": "Some folks may be unable to mention teammates in channels shared between workspaces on the same Enterprise Grid organization. Thanks for your patience while we investigate this, and we\u0027ll let you know when we have more news to share."
      }
    ]
  },
  {
    "id": 742,
    "date_created": "2019-08-02T03:08:23-07:00",
    "date_updated": "2019-08-02T08:16:23-07:00",
    "title": "Mentions in shared channels not working for Enterprise Grid workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-08/315584cef7d15e2e",
    "services": [
      "Notifications",
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-08-02T08:16:23-07:00",
        "body": "We resolved the problem with mentions in shared channels on Enterprise Grid. They should now be working as expected. Apologies for the trouble."
      },
      {
        "date_created": "2019-08-02T03:08:23-07:00",
        "body": "We\u0027re currently experiencing problems with shared channels on Enterprise Grid. Some people cannot mention members of the external organization. Apologies for the disruption - we\u0027re looking into it."
      }
    ]
  },
  {
    "id": 741,
    "date_created": "2019-07-31T19:08:27-07:00",
    "date_updated": "2019-07-31T21:36:45-07:00",
    "title": "Customers may be unable to view or open support tickets via the Help portal",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/75cb43e5ce3b1141",
    "services": [],
    "notes": [
      {
        "date_created": "2019-07-31T21:36:45-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 31, 2019, at 3:25 p.m. PDT, one of our service providers made an API change that disrupted our ability to read incoming data correctly. This affected the display and functionality of support requests on our Help portal. We put a fix in place to account for those changes and confirmed the issue was resolved at July 31, 2019 at 7:39 p.m. PDT."
      },
      {
        "date_created": "2019-07-31T20:14:19-07:00",
        "body": "We have resolved the issue and the Help portal is running smoothly once again. Thank you for being patient with us while we worked to fix this."
      },
      {
        "date_created": "2019-07-31T19:08:27-07:00",
        "body": "We\u0027re investigating an issue with our Help portal and you may not be able to view or open tickets with our support team there at the moment. For now, you can reach us directly by emailing feedback@slack.com. Our replies are also delivered to the email address associated with your Slack account — please check your inbox for these in the meantime.\r\n\r\nApologies for the disruption. We appreciate you bearing with us."
      }
    ]
  },
  {
    "id": 739,
    "date_created": "2019-07-31T10:37:45-07:00",
    "date_updated": "2019-07-31T14:24:53-07:00",
    "title": "File uploads failing on the Android app",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/9223a9e240836ac1",
    "services": [],
    "notes": [
      {
        "date_created": "2019-07-31T14:24:53-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 30, 2019 at 10:46 p.m. PDT, we began to receive reports that users could not upload files to Slack if they tapped on the paperclip icon in the Android app. We investigated the issue and identified that a backend change to the upload flow was broken for a small number of users. On July 31, 2019, we reverted that change and the issue was fully resolved by 1:34 p.m. PDT."
      },
      {
        "date_created": "2019-07-31T13:37:45-07:00",
        "body": "We\u0027ve narrowed things down and have rolled out a fix for file uploads on the Android app. In case you\u0027re still having trouble, please reach out to feedback@slack.com"
      },
      {
        "date_created": "2019-07-31T10:42:45-07:00",
        "body": "We\u0027ve received reports of file uploads failing on the Android app. We\u0027re investigating the issue and will report back when we have more details to share."
      }
    ]
  },
  {
    "id": 737,
    "date_created": "2019-07-30T12:27:07-07:00",
    "date_updated": "2019-07-31T06:14:30-07:00",
    "title": "Some folks may be having trouble with search in Slack",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/36d31cdda97809a2",
    "services": [
      "Search",
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-07-31T06:14:30-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 30, 2019 at 9:45 a.m. PDT, we discovered that a change we made to our APIs was unintentionally causing message searching via our mobile apps and some of our external APIs to fail. We immediately began investigating these failures and deployed a fix at 12:37 p.m PDT."
      },
      {
        "date_created": "2019-07-30T13:02:19-07:00",
        "body": "We\u0027re happy to report that we’ve resolved the problem, so people should be able to search again. If you\u0027re still experiencing issues, please drop us a line at feedback@slack.com."
      },
      {
        "date_created": "2019-07-30T12:27:07-07:00",
        "body": "Some folks may be experiencing issues with search on mobile as well as searching via the API. We\u0027re looking into this right away and will report back with updates shortly."
      }
    ]
  },
  {
    "id": 736,
    "date_created": "2019-07-30T12:13:24-07:00",
    "date_updated": "2019-07-31T06:10:35-07:00",
    "title": "Some people may be seeing an error when sending or viewing some Direct Messages",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/5b3dde376fb0fa38",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-07-31T06:10:35-07:00",
        "body": "Incident Summary:\r\n\r\nOn July 30, 2019 at 10:13 a.m. PDT, we released a minor change to our UI that inadvertently caused Direct Messages to fail to load when their associated user didn\u0027t have an explicit time zone set. We reverted this change at 12:37 p.m. PDT, resolving the issue for all affected users after they reloaded the client."
      },
      {
        "date_created": "2019-07-30T12:56:48-07:00",
        "body": "People should be able to access and send Direct Messages properly now after a refresh (Cmd/Ctrl + R). Thanks for your patience."
      },
      {
        "date_created": "2019-07-30T12:50:09-07:00",
        "body": "Some users might be seeing an error when accessing or viewing some of their Direct Messages. We\u0027re currently investigating this and we\u0027ll send updates as they come."
      },
      {
        "date_created": "2019-07-30T12:13:24-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 738,
    "date_created": "2019-07-31T04:49:58-07:00",
    "date_updated": "2019-07-31T05:08:58-07:00",
    "title": "Two-factor authentication codes not delivered via SMS",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/6af58d307bad3ce7",
    "services": [
      "Login/SSO"
    ],
    "notes": [
      {
        "date_created": "2019-07-31T05:08:58-07:00",
        "body": "The issue is resolved and 2FA codes are now being delivered as expected. We\u0027re sorry for the hassle."
      },
      {
        "date_created": "2019-07-31T04:49:58-07:00",
        "body": "We\u0027ve received reports of SMS codes for two-factor authentication not being delivered to some people. Apologies for the trouble - we\u0027re looking into this with our service provider for SMS."
      }
    ]
  },
  {
    "id": 735,
    "date_created": "2019-07-29T07:54:26-07:00",
    "date_updated": "2019-07-29T19:37:35-07:00",
    "title": "Issues with messages sending and slow performance",
    "type": "outage",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/b31a6510b8caabcc",
    "services": [
      "Connections",
      "Messaging",
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-07-29T19:37:35-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 29, 2019, at 7:23 a.m. PDT, we made a change that inadvertently caused some performance issues, including messages failing to send. Some customers had trouble accessing their Slack workspaces entirely. By 8:47 a.m. PDT, we identified the cause and reverted the change. The issue was fully resolved by 8:48 a.m. PDT."
      },
      {
        "date_created": "2019-07-29T08:54:05-07:00",
        "body": "We\u0027re pleased to report that we have the all clear, and all functionality is now restored. Thanks so much for bearing with us in the meantime."
      },
      {
        "date_created": "2019-07-29T08:30:22-07:00",
        "body": "Customers may be running into trouble accessing their Slack workspaces completely. We\u0027re actively looking into this and apologize for the interruption to your day."
      },
      {
        "date_created": "2019-07-29T07:54:26-07:00",
        "body": "Some workspaces might be experiencing issues with messages sending, and slow performance across the board. Our team is on the case and we\u0027ll report back once we have an update to share."
      }
    ]
  },
  {
    "id": 724,
    "date_created": "2019-07-18T00:45:25-07:00",
    "date_updated": "2019-07-28T21:03:24-07:00",
    "title": "Issues authenticating Google account with certain Slack apps",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/cd4fa8d994d279dd",
    "services": [
      "Apps/Integrations/APIs",
      "Login/SSO"
    ],
    "notes": [
      {
        "date_created": "2019-07-28T21:03:24-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 16, 2019, at 1:56 p.m. PDT, we began a rollout of a new Google API Client. On July 17, we started receiving reports of various problems with Google Calendar and Google Drive integrations, including issues with authenticating and calendar events not displaying. Investigations began at 7:39 a.m., and we worked to identify and address each issue individually.\r\n\r\nOn July 19 at 12:00 p.m., the last fix was pushed out and we continued to monitor the situation. Some customers reported that they were still running into 500 errors in the Google Calendar app and we made a change to prevent this from happening.\r\n\r\nFinally, we restored any calendar connections that had been lost. This was completed on July 26, at 4:11 p.m., and we declared the issue fully resolved."
      },
      {
        "date_created": "2019-07-23T18:11:56-07:00",
        "body": "We believe we have identified and fixed the issue affecting the Google integrations. If you\u0027re still not receiving notifications from \"Google Calendar for Team Events\" please try re-saving your integration configuration — which should get things running again. We\u0027re so sorry for all this hassle. Thank you for being so patient."
      },
      {
        "date_created": "2019-07-21T06:18:00-07:00",
        "body": "Some customers may still be having problems with the Google Drive and Google Calendar Slack apps. We had thought this was fixed but it looks like we spoke too soon. We\u0027ll update here as soon as it\u0027s fully patched. Again, we appreciate your patience."
      },
      {
        "date_created": "2019-07-19T17:55:00-07:00",
        "body": "Good news! We have pushed out a fix to resolve the Google authentication issue affecting the Google Drive and Google Calendar for Team Events apps. You may need to refresh for the changes to apply. Thanks for your patience!"
      },
      {
        "date_created": "2019-07-18T06:32:45-07:00",
        "body": "We believe we mitigated most of the issues with Google authentication in Slack apps but we\u0027re not completely out of the woods. We\u0027re continuing work to restore full functionality."
      },
      {
        "date_created": "2019-07-18T00:59:45-07:00",
        "body": "Some users may be experiencing issues when authenticating their Google account with Slack apps (Google Drive and Google Calendar for Team Events). We are looking into this at the moment and will share an update just as soon as we have it."
      },
      {
        "date_created": "2019-07-18T00:45:25-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 723,
    "date_created": "2019-07-15T06:36:02-07:00",
    "date_updated": "2019-07-26T19:56:18-07:00",
    "title": "Problems with the billing page and billing related emails from Slack",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/798b2601a09212ca",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-07-26T19:56:18-07:00",
        "body": "Issue Summary\r\n\r\nFrom July 12, 2019 to July 15, 2019, we encountered issues with the systems used to to adjust credits on workspaces when membership or user activity changes.\r\n\r\nWe were able to restore the system on July 16, 2019, and backfilled data to adjust credits and provide refunds for teams overcharged. During this time, customers may have seen issues with missing or incorrect invoices, incorrect member changes in some emails, and incorrect information on their billing pages."
      },
      {
        "date_created": "2019-07-18T07:13:19-07:00",
        "body": "We\u0027ve isolated the issue and have begun working to correct the member changes on the workspace billing page. We are taking steps to ensure that member changes are accurate moving forward, and that there are no more errors in the Admin weekly emails. We\u0027re sorry for any concern caused by this issue, and are working to make sure we can avoid this coming up again in the future. We\u0027ll report back with an Issue Summary shortly."
      },
      {
        "date_created": "2019-07-15T17:45:05-07:00",
        "body": "We’re still looking into the issues with the billing page and billing related emails, but we don’t have additional information to share just yet. We appreciate your patience."
      },
      {
        "date_created": "2019-07-15T11:44:52-07:00",
        "body": "Some workspaces may be seeing inaccurate counts of active and inactive members on their billing pages and in relevant emails. We\u0027ve identified a possible fix to get things back in order, and we\u0027ll keep you posted once we have more news to share."
      },
      {
        "date_created": "2019-07-15T06:52:32-07:00",
        "body": "Some users may be noticing an incorrect user count on their workspace billing page, as well as errors in billing and admin related emails received from Slack. Thank you for bearing with us while we investigate further."
      }
    ]
  },
  {
    "id": 734,
    "date_created": "2019-07-26T14:52:17-07:00",
    "date_updated": "2019-07-26T16:32:14-07:00",
    "title": "Connection issues for desktop app v 3.2.0 and older",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/3fd3dc67d28ec28c",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-07-26T16:32:14-07:00",
        "body": "On July 26, 2019, at 2:05 p.m. PDT, we received reports that some users were unable to connect to Slack. Upon investigation, we learned that our latest code change was incompatible with the desktop app versions 3.2.0 or older. The result was that users trying to connect to Slack using these older apps were unable to do so. We identified the problem and reverted this code change. The issue was fully resolved by 3.42 p.m. PDT."
      },
      {
        "date_created": "2019-07-26T15:46:52-07:00",
        "body": "We are happy to report this issue has been resolved, users running desktop app v 3.2.0 or older should be back up and running. Apologies for any disruption to your day."
      },
      {
        "date_created": "2019-07-26T15:30:03-07:00",
        "body": "We\u0027re still trying to pin down the root cause of the desktop app v 3.2.0 and older failing to connect. In the meantime, please update the app to get things running again. Apologies for any disruption to your day."
      },
      {
        "date_created": "2019-07-26T15:00:18-07:00",
        "body": "We’ve heard reports that some people using older versions of the desktop app are having trouble connecting to Slack. If you are still running into issues after updating, please let us know. https://slack.com/downloads"
      },
      {
        "date_created": "2019-07-26T14:52:17-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 733,
    "date_created": "2019-07-26T07:07:55-07:00",
    "date_updated": "2019-07-26T14:27:28-07:00",
    "title": "Some users may have troubles connecting",
    "type": "outage",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/71c400a19c9932e2",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-07-26T14:27:28-07:00",
        "body": "On July 26 from 05:00 a.m. PDT, some users began to experience connectivity issues. This was determined to have been caused in part by a code change published the night before. While reverting this change and attempting to recover from its downstream effects, users began to experience failures while sending messages as an unintended side effect. As a result, we rolled back this attempted fix and began applying it again, this time more slowly, bringing full recovery to impacted users by 10:25 a.m. PDT."
      },
      {
        "date_created": "2019-07-26T10:25:27-07:00",
        "body": "Things should be back to normal and users should no longer see issues connecting. If you\u0027re still having troubles, let us know at feedback@slack.com."
      },
      {
        "date_created": "2019-07-26T10:07:55-07:00",
        "body": "We\u0027re seeing signs of recovery and users should see improvements. We\u0027ll let you know when things are fully back to normal."
      },
      {
        "date_created": "2019-07-26T09:37:55-07:00",
        "body": "We don\u0027t have any further updates right now, but thank you for your patience while we continue towards a solution."
      },
      {
        "date_created": "2019-07-26T09:07:55-07:00",
        "body": "We’re still working to fix the varying issues that have been impacting some workspaces. We hope to have the issue fully resolved as soon as possible."
      },
      {
        "date_created": "2019-07-26T08:37:55-07:00",
        "body": "We\u0027re getting close to a solution, but we aren\u0027t in the clear just yet."
      },
      {
        "date_created": "2019-07-26T08:07:55-07:00",
        "body": "Users may see varying symptoms including missing channels and troubles loading messages. Thanks for sticking with us through this."
      },
      {
        "date_created": "2019-07-26T07:37:55-07:00",
        "body": "We\u0027re still investigating an issue with connections and we don\u0027t have any news to share just yet."
      },
      {
        "date_created": "2019-07-26T07:07:55-07:00",
        "body": "Some folks may see issues connecting to Slack and symptoms may vary for users. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 731,
    "date_created": "2019-07-25T07:56:42-07:00",
    "date_updated": "2019-07-25T22:15:17-07:00",
    "title": "We’re investigating an issue with the Email app",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/94caadc5d3f7a7dd",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-07-25T22:15:17-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 24, 2019 at 12:31 p.m. PDT, we started receiving reports of the \"Email to Slack\" app failing to load in a new window. The root cause was traced to a recent update, which caused a relevant process to experience errors. We tweaked the update, which allowed it to start running as expected, and by July 25, 2019 at 10:57 a.m. PDT, emails from this app were loading in a new window once again."
      },
      {
        "date_created": "2019-07-25T11:11:46-07:00",
        "body": "The issue with Email to Slack opening in a separate window has been resolved. Our apologies for the trouble in the meantime."
      },
      {
        "date_created": "2019-07-25T07:56:42-07:00",
        "body": "Some folks have reported issues with the Email to Slack app opening in a new window. We’re looking into this and will share any helpful updates as we have them. Apologies about any trouble this causes."
      }
    ]
  },
  {
    "id": 729,
    "date_created": "2019-07-24T23:01:01-07:00",
    "date_updated": "2019-07-25T21:17:45-07:00",
    "title": "Some customers are unable to see the names and icons of some integrations",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/9177845347d064b9",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-07-25T21:17:45-07:00",
        "body": "Issue Summary: \r\n\r\nOn July 24, 2019 at 12:31 p.m. PDT, we started receiving reports of integrations displaying blank names and default icons. The root cause was traced to a recent update, which caused a relevant process to experience errors. We tweaked the update, which allowed it to start running as expected, and by July 25, 2019 at 10:54 a.m. PDT, integration names and icons were loading once again."
      },
      {
        "date_created": "2019-07-25T11:13:27-07:00",
        "body": "Names and icons for integrations should now be displaying as expected. Thank you for your patience while we sorted things out!"
      },
      {
        "date_created": "2019-07-24T23:01:01-07:00",
        "body": "We are investigating an issue with the names and icons of some integrations. Apologies for the trouble and thank you for bearing with us."
      }
    ]
  },
  {
    "id": 730,
    "date_created": "2019-07-25T00:21:01-07:00",
    "date_updated": "2019-07-25T16:27:17-07:00",
    "title": "Errors changing Channel Management settings on Free plan.",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/82f0c4c0a5c0ec53",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-07-25T16:27:17-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 24 from 12:31p.m. PDT - July 25 09:14 a.m. PDT, owners and admins for Slack workspaces on the Free plan were unable to make changes to their channel management settings. \r\n\r\nThis was due to an error that restricted all channel management features to teams on a paid plan. We were able to fix the error on this page, and confirmed everything was back to normal at 09:14 a.m. PDT."
      },
      {
        "date_created": "2019-07-25T09:24:30-07:00",
        "body": "Workspace Owners and Admins should no longer see errors when saving Channel Management settings. Sorry for any disruption!"
      },
      {
        "date_created": "2019-07-25T00:21:01-07:00",
        "body": "We\u0027re investigating an issue where Workspace Admins and Owners on Free plans see errors when saving Channel Management settings. We apologise for the inconvenience and appreciate your patience as we work on this."
      }
    ]
  },
  {
    "id": 728,
    "date_created": "2019-07-24T15:28:57-07:00",
    "date_updated": "2019-07-24T16:01:28-07:00",
    "title": "Errors with loading channels",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/688c487005b6aaa8",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-07-24T16:01:28-07:00",
        "body": "Thank you for bearing with us as we investigated this. The issue is resolved. If you still see an error, a refresh (Cmd/Ctrl-R) should fix it."
      },
      {
        "date_created": "2019-07-24T15:28:57-07:00",
        "body": "We are looking into issues with loading channels. We\u0027ll report back here once we have more information."
      }
    ]
  },
  {
    "id": 727,
    "date_created": "2019-07-22T18:19:04-07:00",
    "date_updated": "2019-07-22T21:27:55-07:00",
    "title": "Some customers may be experiencing issues with Slack",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/71c9a4324a1b70ab",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-07-22T21:27:55-07:00",
        "body": "Incident Summary:\r\n\r\nOn July 22, 2019 at 3:20 p.m. PDT, we ran a script that inadvertently caused a backlog in the job queue. Our internal monitoring system alerted us to this and we reverted the script. By 7:40 p.m. PDT, the job queue had cleared and the issue was fully resolved."
      },
      {
        "date_created": "2019-07-22T19:40:21-07:00",
        "body": "The issues reported earlier has been resolved. If you see any problems with messaging in your Slack workspace, please report this to feedback@slack.com and we’ll be happy to take a closer look."
      },
      {
        "date_created": "2019-07-22T18:19:04-07:00",
        "body": "We\u0027re on the case and digging in to this. Thank you for bearing with us, we\u0027re very sorry for the disruption."
      }
    ]
  },
  {
    "id": 725,
    "date_created": "2019-07-18T01:05:59-07:00",
    "date_updated": "2019-07-18T17:54:38-07:00",
    "title": "Enterprise Grid workspaces unable to invite Guests",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/accf36fb7063adf8",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-07-18T17:54:38-07:00",
        "body": "We\u0027re happy to report that the issue with Guest invitations to Enterprise Grid workspaces has been resolved. If you\u0027re experiencing any trouble with invites, please write in through feedback@slack.com and we\u0027ll be there to help."
      },
      {
        "date_created": "2019-07-18T01:36:59-07:00",
        "body": "Our team is investigating the cause of Guest invites not working on Enterprise Grid workspaces. We\u0027re sorry for the inconvenience."
      },
      {
        "date_created": "2019-07-18T01:06:59-07:00",
        "body": "We\u0027re still working to fix Guest invites on Enterprise Grid workspaces. If you need to add a Guest to a Grid workspace, please reach out to feedback@slack.com and we\u0027ll be able to assist."
      },
      {
        "date_created": "2019-07-18T01:05:59-07:00",
        "body": "We\u0027ve received reports that workspaces on Slack Enterprise Grid are running into problems when trying to invite Guests. We\u0027re looking into it and apologize for the disruption."
      }
    ]
  },
  {
    "id": 722,
    "date_created": "2019-07-11T09:09:00-07:00",
    "date_updated": "2019-07-11T09:09:00-07:00",
    "title": "Customers may be seeing message send failures or API errors",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/6d145ef8587c0cf1",
    "services": [
      "Apps/Integrations/APIs",
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-07-11T09:09:00-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 11, 2019 at 9:09 a.m. PDT, an update to how we route server requests caused an unforeseen issue, whereby some customers experienced API errors or trouble sending messages. We halted the rollout of this update, and the issue was resolved at 9:35 a.m. PDT. We\u0027re holding off on further changes until we\u0027re confident we can proceed without customer impact."
      }
    ]
  },
  {
    "id": 721,
    "date_created": "2019-07-10T15:44:22-07:00",
    "date_updated": "2019-07-10T16:11:22-07:00",
    "title": "Our upstream service provider is experiencing trouble and is unable to process payments",
    "type": "notice",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/110e3e47b76af190",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-07-10T16:11:22-07:00",
        "body": "We’re happy to report our upstream service provider has resolved any issues and can process payments again. Thanks for bearing with us."
      },
      {
        "date_created": "2019-07-10T16:02:15-07:00",
        "body": "We are unable to process credit card payments for self service customers due to an issue with our upstream service provider. We’re looking into it and we’ll keep you posted on any updates."
      },
      {
        "date_created": "2019-07-10T15:44:22-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 719,
    "date_created": "2019-07-08T19:58:07-07:00",
    "date_updated": "2019-07-09T19:40:40-07:00",
    "title": "Apps cannot rename archived channels via the API",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/427282be96394228",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-07-09T19:40:40-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 8, 2019 at 7:32 p.m. PDT, we received reports of API requests to rename channels failing for some customers. After some investigation we traced the root cause to a recent deploy and reverted it, which resolved the issue.\r\nBy July 9 at 11:42 p.m. PDT, all API requests to rename channels were successful and we were able to call the all clear."
      },
      {
        "date_created": "2019-07-09T12:00:43-07:00",
        "body": "Our engineers have pushed a fix and apps should once again be able to rename archived channels. If you\u0027re still having troubles, let us know."
      },
      {
        "date_created": "2019-07-08T19:58:07-07:00",
        "body": "We are investigating an issue where apps cannot rename archived channels. We\u0027re on the case and digging in to this. Thank you for bearing with us."
      }
    ]
  },
  {
    "id": 720,
    "date_created": "2019-07-09T07:21:53-07:00",
    "date_updated": "2019-07-09T10:02:58-07:00",
    "title": "Some customers experiencing slow file uploads",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/e7ff31c9c62b88c4",
    "services": [
      "Posts/Files"
    ],
    "notes": [
      {
        "date_created": "2019-07-09T10:02:58-07:00",
        "body": "Things have been stabilized on our side, but if you\u0027re still having any troubles, feel free to let us know at feedback@slack.com."
      },
      {
        "date_created": "2019-07-09T08:40:34-07:00",
        "body": "Work is still ongoing, but file uploads should be back to normal for users. Thanks again for hanging in there."
      },
      {
        "date_created": "2019-07-09T08:10:34-07:00",
        "body": "Our engineers are still on the case, though we have no new updates to share just yet."
      },
      {
        "date_created": "2019-07-09T07:40:34-07:00",
        "body": "We\u0027re investigating an issue and some customers may experience slower than normal file uploads. Thank you for your patience while we look into this."
      },
      {
        "date_created": "2019-07-09T07:21:53-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 716,
    "date_created": "2019-07-02T13:44:58-07:00",
    "date_updated": "2019-07-05T12:59:45-07:00",
    "title": "Some people are experiencing failed searches",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/36024596448ac86c",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-07-05T12:59:45-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 2, 2019 at 1:44 p.m. PDT searches began to fail for a subset of users. After some investigation, the root cause was traced to a set of very large messages causing the search indexing feature to become overloaded and fail. We suspended these specific messages from being indexed and implemented a message-index size limit. This allowed systems to return back to normal by July 4, 2019 at 12:07 a.m. PDT."
      },
      {
        "date_created": "2019-07-04T10:28:22-07:00",
        "body": "Search functionality should now be working again for all customers. Sorry for the hassle and thanks for sticking with us. If you experience issues with searching in Slack please write in to feedback@slack.com"
      },
      {
        "date_created": "2019-07-02T16:18:58-07:00",
        "body": "Search functionality should be restored for all users at this time but we are investigating all avenues before calling all clear."
      },
      {
        "date_created": "2019-07-02T15:48:01-07:00",
        "body": "We have no new information to share just yet, but we\u0027re continuing our efforts to fully restore search. Thanks for sticking with us."
      },
      {
        "date_created": "2019-07-02T15:18:02-07:00",
        "body": "Search functionality has still not been fully restored, we’re working hard to fix that. We apologize for the disruption and we hope to be back to normal soon."
      },
      {
        "date_created": "2019-07-02T14:48:13-07:00",
        "body": "Our engineers are still looking into what’s causing problems with search for some people. We\u0027ll continue to update you on our progress."
      },
      {
        "date_created": "2019-07-02T14:18:21-07:00",
        "body": "Our engineers are still investigating the cause of search failure for some customers. We\u0027re sorry for any disruption this has caused to your day."
      },
      {
        "date_created": "2019-07-02T13:48:48-07:00",
        "body": "We’ve heard reports that some people are having trouble with search. We’re looking into it and we’ll keep you posted on any updates."
      },
      {
        "date_created": "2019-07-02T13:44:58-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 718,
    "date_created": "2019-07-03T14:11:03-07:00",
    "date_updated": "2019-07-03T15:39:58-07:00",
    "title": "Apps are not installing properly on some workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/2ade886ae78d67be",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-07-03T15:39:58-07:00",
        "body": "Thank you for your patience. We discovered we were displaying the incorrect error page to notify users who did not have the permissions to install apps. The correct error message should now be showing. This issue did not impact users who had valid permissions to install apps on their workspace."
      },
      {
        "date_created": "2019-07-03T14:11:03-07:00",
        "body": "We\u0027ve found that some workspaces are having issues installing apps. We\u0027re looking into it now and will report back once we know more."
      }
    ]
  },
  {
    "id": 717,
    "date_created": "2019-07-02T22:06:06-07:00",
    "date_updated": "2019-07-03T00:14:07-07:00",
    "title": "Some customers are unable to load new messages or their channel sidebar",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/dc2de16beb69db13",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-07-03T00:14:07-07:00",
        "body": "Issue Summary:\r\n\r\nOn July 2, 2019 at 6:39 p.m. PDT, we received reports of messages and the channel sidebar not loading for some customers. We launched an investigation and by July 2 at 11:01 p.m. PDT, all customers were able to correctly connect and the issue was resolved."
      },
      {
        "date_created": "2019-07-02T23:08:30-07:00",
        "body": "We\u0027ve been monitoring things and believe everyone should be able to see their messages and channel sidebar information once more. If you\u0027re still experiencing issues please let us know at feedback@slack.com. Thanks for sticking with us through that."
      },
      {
        "date_created": "2019-07-02T22:49:10-07:00",
        "body": "We\u0027re still trying to pin down the root cause of the issues with loading news messages and channel sidebar information. We\u0027ll keep you posted."
      },
      {
        "date_created": "2019-07-02T22:18:14-07:00",
        "body": "We\u0027re looking into why some customers are having trouble loading new messages or their channel sidebar. Sorry for this disruption."
      },
      {
        "date_created": "2019-07-02T22:06:06-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 715,
    "date_created": "2019-07-02T07:04:09-07:00",
    "date_updated": "2019-07-02T07:59:46-07:00",
    "title": "Issues getting in touch with Slack Support",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-07/ee6adc33c3a704df",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-07-02T07:59:46-07:00",
        "body": "We\u0027ve kept an eye on the upstream troubles that were causing errors with our Help Center and getting in touch with our support team, and all seems to be doing much better now. Please don\u0027t hesitate to reach out to us if you\u0027re still seeing any issues on this front."
      },
      {
        "date_created": "2019-07-02T07:04:09-07:00",
        "body": "We’re investigating an issue with our upstream provider that may impact our ability to respond to customer support tickets, and for customers to access our Help Center. We sincerely apologize for any trouble this is causing, and we’ll keep you updated once things are back to normal."
      }
    ]
  },
  {
    "id": 712,
    "date_created": "2019-06-26T08:08:17-07:00",
    "date_updated": "2019-07-01T18:49:19-07:00",
    "title": "Issues with Outlook Calendar",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/d1ff53f642dc1b12",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-07-01T18:49:19-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 26, 2019 at 7:00 a.m. PDT, we deployed a change that unintentionally caused requests to the Outlook Calendar Integration to timeout.  We launched an investigation and put a fix in place at 10:13 a.m. PDT. We monitored the functionality to ensure it was working correctly again and then declared the issue fully resolved at 11:24 p.m. PDT."
      },
      {
        "date_created": "2019-06-26T11:28:32-07:00",
        "body": "Good news! We\u0027re now confident that issues with the Outlook Calendar integration are resolved. We apologize again for the mix-up here, and thank you for your patience while we got this fixed up."
      },
      {
        "date_created": "2019-06-26T10:03:04-07:00",
        "body": "It looks like we may have spoken too soon, and some Outlook Calendar integration\u0027s are still returning errors. We\u0027re continuing to dig into this to tie up any loose ends and will let you know when things have improved. We apologize for the mixed messaging."
      },
      {
        "date_created": "2019-06-26T09:26:07-07:00",
        "body": "Our team has called an All Clear on the troubles with Outlook Calendar, and the slash command should be working properly again. Please let us know if this isn\u0027t the case at feedback@slack.com."
      },
      {
        "date_created": "2019-06-26T08:17:27-07:00",
        "body": "Our team is investigating the root cause for timeout errors with the Outlook Calendar integration. We\u0027ll let you know when there\u0027s more to share."
      }
    ]
  },
  {
    "id": 713,
    "date_created": "2019-06-26T11:05:47-07:00",
    "date_updated": "2019-07-01T17:29:19-07:00",
    "title": "Workspace analytics are not updating properly",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/ac242b674c1b106d",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-07-01T17:29:19-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 20, 2019, we began to receive reports that the Analytics pages were not updating to display the latest workspace data. We investigated the issue and found an overloaded server to be the cause of the issue. We restarted that server and this fixed the issue. On June 23, 2019, we identified a similar issue. We restarted the server to initiate the analytics updates. By June 27 at 8:51 p.m. PDT, all analytics data was up to date and the issue was resolved."
      },
      {
        "date_created": "2019-06-27T08:56:42-07:00",
        "body": "The fix for the workspace analytics is out, and we believe all should be running as expected now. We\u0027re very sorry for any confusion this may have caused. If you\u0027re still seeing continued issues, we\u0027d be happy to investigate at feedback@slack.com."
      },
      {
        "date_created": "2019-06-26T12:51:32-07:00",
        "body": "We\u0027ve begun working on a fix, but we\u0027re not out of the woods yet. We\u0027ll be back with more updates once that fix has been rolled out to everyone, and we apologize for any inconvenience in the meantime."
      },
      {
        "date_created": "2019-06-26T12:18:15-07:00",
        "body": "We\u0027re still working on getting the workspace analytics page back to normal. Thank you again for your patience and we\u0027ll be back with more updates as they become available."
      },
      {
        "date_created": "2019-06-26T11:44:39-07:00",
        "body": "We’ve found this issue’s root cause and we’re working hard to get everything displaying properly again. Thanks for bearing with us in the meantime."
      },
      {
        "date_created": "2019-06-26T11:13:07-07:00",
        "body": "We\u0027ve received reports of issues with workspace analytics data, and our team is on the case to see how we can get that information accurately displayed again. We\u0027ll keep you updated as our investigation progresses."
      }
    ]
  },
  {
    "id": 714,
    "date_created": "2019-06-28T04:54:12-07:00",
    "date_updated": "2019-06-29T19:58:21-07:00",
    "title": "Degraded functionality with several features",
    "type": "outage",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/9f63d8e30ee85f46",
    "services": [
      "Workspace/Org Administration",
      "Connections",
      "Messaging",
      "Link Previews",
      "Posts/Files",
      "Notifications"
    ],
    "notes": [
      {
        "date_created": "2019-06-29T19:58:21-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 28, 2019 at 4:30 a.m. PDT some of our servers became unavailable, causing degraded performance in our job processing system. This resulted in delays or errors with features such notifications, unfurls, and message posting.\r\n\r\nDuring this time, approximately 10-25% of jobs resulted in errors or failure. By 10:00 a.m. PDT, we fully restored message delivery and reduced the error rates to less than 5% as the team continued to work on a full recovery.\r\n\r\nAt 1:05 p.m. PDT, a separate issue increased server load and dropped a large number of user connections. Reconnection attempts further increased the server load, slowing down customer reconnection. Server capacity was freed up eventually, enabling all customers to reconnect by 1:36 p.m. PDT.\r\n\r\nFull service restoration was completed by 7:20 p.m. PDT. During this period, customers faced delays or failure with a number of features including file uploads, notifications, search indexing, link unfurls, and reminders.\r\n\r\nNow that service has been restored, the response team is continuing their investigation and working to calculate service interruption time as soon as possible. We’re also working on preventive measures to ensure that this doesn’t happen again in the future. If you’re still running into any issues, please reach out to us at feedback@slack.com."
      },
      {
        "date_created": "2019-06-28T20:15:36-07:00",
        "body": "A fix has been rolled out and all features should be working normally. We are immensely sorry for the disruption to your work day and are continuing the work to make sure this doesn\u0027t happen again. \r\n\r\nIf you are still seeing any issues, please don\u0027t hesitate to drop us a line via our help page or feedback@slack.com — we\u0027re here to help."
      },
      {
        "date_created": "2019-06-28T19:27:01-07:00",
        "body": "We\u0027re seeing positive signs with some changes being rolled out, and are continuing to work to get things back to 100%. We really appreciate your patience."
      },
      {
        "date_created": "2019-06-28T18:14:09-07:00",
        "body": "Customers may see degraded functionality for several other features, including notifications, reminders and workspace member lists — we\u0027re working to restore that. File uploads should now work after a refresh (Cmd/Ctrl + R)."
      },
      {
        "date_created": "2019-06-28T16:54:03-07:00",
        "body": "We’re still working hard to restore file upload functionality. Thank you for your continued patience."
      },
      {
        "date_created": "2019-06-28T15:56:36-07:00",
        "body": "File uploads are still not working for some users but refreshing Slack (Cmd/Ctrl + R) may restore functionality."
      },
      {
        "date_created": "2019-06-28T15:25:23-07:00",
        "body": "We don\u0027t have any updates right now. Refreshing Slack (Cmd/Ctrl + R) should restore connectivity but we’re still working on file uploads."
      },
      {
        "date_created": "2019-06-28T14:54:27-07:00",
        "body": "We expect users to be able to connect to Slack after a refresh (Cmd/Ctrl + R) but we are still experiencing some issues with file uploads."
      },
      {
        "date_created": "2019-06-28T14:24:03-07:00",
        "body": "We are still seeing reports from many users unable to connect to Slack. We truly appreciate your patience while we monitor the situation."
      },
      {
        "date_created": "2019-06-28T13:54:07-07:00",
        "body": "Some users have reported problems loading Slack. We\u0027ll continue to update you on our progress."
      },
      {
        "date_created": "2019-06-28T13:24:22-07:00",
        "body": "Some users have reported intermittent connectivity issues. We remain hard at work to come to a full resolution."
      },
      {
        "date_created": "2019-06-28T12:51:29-07:00",
        "body": "Still no news to share on a resolution, but please continue to let us know if you\u0027re running into any trouble after reloading. We\u0027ll return with more updates soon."
      },
      {
        "date_created": "2019-06-28T12:21:34-07:00",
        "body": "We\u0027re still working on getting things completely fixed up, but for now reloading should help. If this doesn\u0027t lead to improvements, though, drop us a line at feedback@slack.com."
      },
      {
        "date_created": "2019-06-28T11:51:47-07:00",
        "body": "We’re seeing that functionality may be restored after reloading (Cmd/Ctrl + R). If you\u0027re still running into trouble after giving that a try, please let us know at feedback@slack.com."
      },
      {
        "date_created": "2019-06-28T11:34:07-07:00",
        "body": "No news to share just yet, but we remain hard at work to get everything running smoothly again. We appreciate your patience in the meantime."
      },
      {
        "date_created": "2019-06-28T11:04:39-07:00",
        "body": "We\u0027re seeing some signs of recovery, though we aren\u0027t in the clear yet. We\u0027ll continue to keep you posted on our progress."
      },
      {
        "date_created": "2019-06-28T10:33:57-07:00",
        "body": "We\u0027re still investigating some potential fixes, but don\u0027t have any news to share just yet. Thank you for your continued patience."
      },
      {
        "date_created": "2019-06-28T10:03:05-07:00",
        "body": "We\u0027re still on the case, and are doing everything we can to restore all functionality in Slack. We\u0027ll be back with more updates soon."
      },
      {
        "date_created": "2019-06-28T09:33:09-07:00",
        "body": "We\u0027re continuing to work on getting everything up and running again. Though we saw signs of improvement earlier, unfortunately the fix we had in mind didn\u0027t do the trick. We\u0027re now looking into another possible fix and will share updates as they become available."
      },
      {
        "date_created": "2019-06-28T09:03:03-07:00",
        "body": "We\u0027re still looking into the issues with various Slack services, and will continue to keep you posted on our progress. Apologies again for the disruption to your day."
      },
      {
        "date_created": "2019-06-28T08:33:00-07:00",
        "body": "We have no more news to share just yet, just that we\u0027ve got all eyes on this. We\u0027ll keep you posted with updates as we have them."
      },
      {
        "date_created": "2019-06-28T08:03:00-07:00",
        "body": "Work is still ongoing to get functionality back to normal. We appreciate you sticking with us."
      },
      {
        "date_created": "2019-06-28T07:33:00-07:00",
        "body": "Functionality is almost back to normal, but some users may see some sporadic problems while we work on remediation."
      },
      {
        "date_created": "2019-06-28T07:03:00-07:00",
        "body": "Many of our users may still be having problems with several Slack services. We have all hands on-deck working on a solution. We’ll share more news with you all shortly."
      },
      {
        "date_created": "2019-06-28T06:33:00-07:00",
        "body": "We’re still figuring out the problem some users are having with multiple Slack services. We’re so sorry for the interruption. When we find out more, we’ll let you know."
      },
      {
        "date_created": "2019-06-28T06:03:00-07:00",
        "body": "We’re still investigating the issues with several Slack services, but we don’t have additional information just yet. We’ll be back soon with another update. Sorry for the interruption."
      },
      {
        "date_created": "2019-06-28T05:33:29-07:00",
        "body": "Some customers are still reporting issues with multiple Slack services. We\u0027re currently investigating and will keep you posted as soon as we have more information. We\u0027re sorry for the disruption."
      },
      {
        "date_created": "2019-06-28T05:03:29-07:00",
        "body": "We received reports of multiple issues regarding Slack\u0027s degraded performance, which we are currently investigating."
      },
      {
        "date_created": "2019-06-28T04:54:12-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 711,
    "date_created": "2019-06-24T08:57:02-07:00",
    "date_updated": "2019-06-24T17:36:29-07:00",
    "title": "Issues with Google Calendar App",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/84923bd6b49bc84c",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-06-24T17:36:29-07:00",
        "body": "Issue Summary: \r\n\r\nOn June 24, 2019 at 7:00 a.m. PDT, we made a change that inadvertently caused slash commands for the Google Calendar app to fail. We reverted the change and resolved the issue at 9:30 a.m. PDT."
      },
      {
        "date_created": "2019-06-24T09:52:19-07:00",
        "body": "The Google Calendar App is up and running properly. Please let us know at feedback@slack.com if this is not the case, and we\u0027ll have another look."
      },
      {
        "date_created": "2019-06-24T08:57:02-07:00",
        "body": "Some users may be experiencing issues with the Google Calendar App, including missed event notifications and trouble using the slash command. We\u0027re digging into this, and hope to have an update soon."
      }
    ]
  },
  {
    "id": 710,
    "date_created": "2019-06-24T06:23:24-07:00",
    "date_updated": "2019-06-24T09:06:30-07:00",
    "title": "Connectivity issues",
    "type": "notice",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/2f4006c4a749a9b1",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-06-24T09:06:30-07:00",
        "body": "The upstream connection issues should be all cleared up now. If you continue to have any connectivity trouble, please reach out to feedback@slack.com."
      },
      {
        "date_created": "2019-06-24T06:29:38-07:00",
        "body": "We\u0027ve received reports that some folks are having trouble connecting to Slack. It seems this is an upstream issue, but we\u0027ll keep you updated here if anything changes, or as we have more to share."
      },
      {
        "date_created": "2019-06-24T06:23:24-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 709,
    "date_created": "2019-06-21T12:54:44-07:00",
    "date_updated": "2019-06-21T14:00:30-07:00",
    "title": "Calls not working for some beta customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/816a2c1d95381a72",
    "services": [
      "Calls"
    ],
    "notes": [
      {
        "date_created": "2019-06-21T14:00:30-07:00",
        "body": "Good news! We\u0027re happy to report that we’ve isolated the problem, so people should be able to use the Calls feature again. Some folks may need to refresh (Ctrl/Cmd + R)."
      },
      {
        "date_created": "2019-06-21T13:54:11-07:00",
        "body": "The team have identified the problem and are close to rolling out a fix. We hope to have more good news to share shortly."
      },
      {
        "date_created": "2019-06-21T13:24:19-07:00",
        "body": "Our engineers continue to investigate the disruption to Calls for some beta customers. Thanks for bearing with us."
      },
      {
        "date_created": "2019-06-21T12:54:44-07:00",
        "body": "Some beta customers are having trouble with Calls. Our engineers are on the case, and we\u0027ll be back once we have more news to share. Apologies for any interruption to your day."
      }
    ]
  },
  {
    "id": 708,
    "date_created": "2019-06-20T17:29:05-07:00",
    "date_updated": "2019-06-20T19:19:27-07:00",
    "title": "Trouble creating Posts",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/ef8507bbce2397f4",
    "services": [
      "Posts/Files"
    ],
    "notes": [
      {
        "date_created": "2019-06-20T19:19:27-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 20, 2019 at 2:13 p.m. PDT, some users began receiving \"404\" errors when attempting to create new Posts. After some investigation, the root cause was traced to a particular server. Restarting this server\u0027s processes fixed the issue and normal function was restored by 6:23 p.m. PDT."
      },
      {
        "date_created": "2019-06-20T18:08:56-07:00",
        "body": "We\u0027re seeing positive signs that Posts can be created again. We\u0027re sorry for the disruption this caused. If you continue to have any trouble creating Posts, please let us know through feedback@slack.com."
      },
      {
        "date_created": "2019-06-20T17:29:05-07:00",
        "body": "Some people may be having an issue creating Posts. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 707,
    "date_created": "2019-06-20T13:25:03-07:00",
    "date_updated": "2019-06-20T18:37:52-07:00",
    "title": "Some people may have trouble loading images",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/629f55f328578c4a",
    "services": [
      "Link Previews"
    ],
    "notes": [
      {
        "date_created": "2019-06-20T18:37:52-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 20, 2019 at 12:29 p.m. PDT, a small number of servers started experiencing issues. As a result, image previews, in addition to Twitter feeds, began failing. By 3:30 p.m., the problematic servers were fixed and these features started displaying as expected."
      },
      {
        "date_created": "2019-06-20T15:35:44-07:00",
        "body": "For those affected, we’re happy to report that all images should be loading properly in Slack. We apologize for the inconvenience. We’ll report back with an Issue Summary shortly."
      },
      {
        "date_created": "2019-06-20T14:55:27-07:00",
        "body": "We\u0027re making some progress, but we\u0027re not yet in the clear. We\u0027ll be updating you again soon. Thanks for your patience today."
      },
      {
        "date_created": "2019-06-20T14:25:29-07:00",
        "body": "We\u0027re still working on getting images to load once again. We hope to have an update soon. Thank you for sticking with us!"
      },
      {
        "date_created": "2019-06-20T13:55:05-07:00",
        "body": "We’re still looking into why images aren\u0027t loading for some people, but we don’t have additional information just yet. We’ll continue to keep you posted."
      },
      {
        "date_created": "2019-06-20T13:25:03-07:00",
        "body": "Some people may be seeing blank boxes instead of images in Slack. We\u0027re sorry for the inconvenience, and we\u0027re looking into this now."
      }
    ]
  },
  {
    "id": 706,
    "date_created": "2019-06-20T04:41:09-07:00",
    "date_updated": "2019-06-20T05:55:28-07:00",
    "title": "Issues with the contact form on the Help Center page",
    "type": "notice",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/f95050c4abb323a8",
    "services": [
      "Login/SSO"
    ],
    "notes": [
      {
        "date_created": "2019-06-20T05:55:28-07:00",
        "body": "The issues with our Help Center contact form should now be resolved. We apologize for any trouble caused and are grateful for your patience."
      },
      {
        "date_created": "2019-06-20T05:12:39-07:00",
        "body": "We can confirm that only the English UK and English US help center pages are impacted by this issue, and that this only affects paid users who are logged into Slack at this time."
      },
      {
        "date_created": "2019-06-20T04:58:09-07:00",
        "body": "If you click on the \u0027write a message button\u0027 on our contact form and do not get redirected, please scroll down the page manually to submit form, and that should work."
      },
      {
        "date_created": "2019-06-20T04:41:09-07:00",
        "body": "We are currently experiencing some issues with the contact form on our help center page. We apologise for any inconvenience and are actively investigating."
      }
    ]
  },
  {
    "id": 705,
    "date_created": "2019-06-19T13:04:53-07:00",
    "date_updated": "2019-06-19T19:41:22-07:00",
    "title": "Members tab on the Analytics page not displaying data for Grid customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/b42af59b1ba3690c",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-06-19T19:41:22-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 18, 2019 at 4:22 p.m. PDT, we made a change to how our workspace analytics pages populated data. This change caused Enterprise Grid users to be unable to view the Members tab on any workspace-specific analytics page they attempted to load. This issue was brought to our attention on June 19 at 12:03 p.m. PDT, at which time we reverted this change and were able to restore the pages\u0027 functionality by 3:09 p.m. PDT, June 19."
      },
      {
        "date_created": "2019-06-19T15:29:47-07:00",
        "body": "Thank you for your patience while we looked into this issue. We can confirm that the Members tab on Grid workspace Analytics pages should show the data now. Our apologies for the disruption."
      },
      {
        "date_created": "2019-06-19T13:04:53-07:00",
        "body": "We\u0027ve had some reports that customers on Grid workspaces are having trouble with the Members tab not returning any data on the Analytics page. Our team is investigating, and we\u0027ll share more updates as we have them. Our apologies for any inconvenience this is causing."
      }
    ]
  },
  {
    "id": 704,
    "date_created": "2019-06-19T02:25:01-07:00",
    "date_updated": "2019-06-19T19:08:58-07:00",
    "title": "Problems with loading Posts",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/9fcc490c8073eba2",
    "services": [
      "Posts/Files"
    ],
    "notes": [
      {
        "date_created": "2019-06-19T19:08:58-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 18, 2019 at 9:43 p.m. PDT, a server update caused an unexpected increase in load time for Posts. Once identified, the update in question was rolled back. By June 19 at 4:06 p.m. PDT Posts were once again loading as expected."
      },
      {
        "date_created": "2019-06-19T16:14:27-07:00",
        "body": "Thank you so much for waiting while we worked on this fix. We can confirm that functionality is restored to Posts. We apologize for the trouble."
      },
      {
        "date_created": "2019-06-19T11:35:20-07:00",
        "body": "Thanks for bearing with us. We\u0027ve identified the root of the problem and are making good progress towards full functionality. If you\u0027re still experiencing trouble with Posts, please let us know at feedback@slack.com."
      },
      {
        "date_created": "2019-06-19T02:25:01-07:00",
        "body": "We\u0027ve received reports of Posts not loading. Apologies for the hassle - our team is investigating the problem."
      }
    ]
  },
  {
    "id": 702,
    "date_created": "2019-06-13T11:54:22-07:00",
    "date_updated": "2019-06-18T09:57:25-07:00",
    "title": "Trouble with the Zendesk integration",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/7b843fb797134cd8",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-06-18T09:57:25-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 7, 2019 at 9:20 a.m. PDT, the Zendesk app (legacy) began to fail delivering some messages and notifications. Our team opened an investigation and discovered some app notifications were being queued up but not posted.\r\n\r\nWe deployed a fix and resolved the issue on June 17, 2019 at 11:00 a.m. PDT. We’re still investigating the root cause of this issue to prevent this from happening again in the future."
      },
      {
        "date_created": "2019-06-17T11:21:09-07:00",
        "body": "We\u0027re happy to report that the functionality of our Zendesk (Legacy) integration has been restored and people should no longer experience issues with missing messages or notifications. Apologies for any disruption to your workflow."
      },
      {
        "date_created": "2019-06-13T17:49:00-07:00",
        "body": "We\u0027re still looking into the issues with the Zendesk (Legacy) integration, but don\u0027t have new information to share just yet. If you see any problems with your Zendesk notifications, please let us know through feedback@slack.com."
      },
      {
        "date_created": "2019-06-13T11:54:22-07:00",
        "body": "We\u0027re seeing some degraded performance with the Zendesk (Legacy) integration, which may lead to some folks missing messages or notifications. We\u0027re on the case and will share updates here."
      }
    ]
  },
  {
    "id": 701,
    "date_created": "2019-06-13T08:32:50-07:00",
    "date_updated": "2019-06-14T08:24:00-07:00",
    "title": "Some customers may be experiencing delayed notifications",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/a4d42925393c92f4",
    "services": [],
    "notes": [
      {
        "date_created": "2019-06-14T08:24:00-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 13, 2019 at 7:30 a.m. PDT, a slowdown in a system element affected notification processing, in turn delaying notification delivery for some customers. Once we learned of this slowdown we were able to resolve the issue and fixed the delay in notifications by 8:29 a.m. PDT."
      },
      {
        "date_created": "2019-06-13T08:50:19-07:00",
        "body": "We\u0027ve looked into this further and found that the notification delays should be all cleared up now. Our sincerest apologies for any disruption to your day."
      },
      {
        "date_created": "2019-06-13T08:39:50-07:00",
        "body": "We\u0027ve received some reports that folks might be receiving delayed notifications. We\u0027re looking into the issue and will report back when we have an update to share."
      },
      {
        "date_created": "2019-06-13T08:32:50-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 703,
    "date_created": "2019-06-13T16:30:51-07:00",
    "date_updated": "2019-06-13T23:12:58-07:00",
    "title": "Some customers are unable to search when using modifiers in non-English languages",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/355c45bbaca6f8a9",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-06-13T23:12:58-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 13, 2019 at 12:52 p.m. PDT, a code change introduced an error, which caused language settings to default to English when using search modifiers. As a result, search results containing non-English modifiers were inaccurate.\r\n\r\nWe launched an investigation and resolved the issue on June 13, 2019 at 5:18 p.m. PDT."
      },
      {
        "date_created": "2019-06-13T17:32:50-07:00",
        "body": "For those affected by the issues with searching and using modifiers, we\u0027re happy to report that these features are working as expected again. We apologise for the trouble this caused."
      },
      {
        "date_created": "2019-06-13T17:09:23-07:00",
        "body": "We’re still digging into the issues with search modifiers, but we don’t have additional information to share just yet. Please continue to bear with us."
      },
      {
        "date_created": "2019-06-13T16:30:51-07:00",
        "body": "Some customers are having trouble searching in Slack when using modifiers (e.g. in:, from:) in non-English languages. We\u0027re currently investigating and we\u0027ll keep you posted. We\u0027re sorry for the disruption to your day."
      }
    ]
  },
  {
    "id": 700,
    "date_created": "2019-06-12T09:02:47-07:00",
    "date_updated": "2019-06-13T17:51:50-07:00",
    "title": "Some customers may be experiencing slowness or missing channel data",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/194fb06129466f74",
    "services": [],
    "notes": [
      {
        "date_created": "2019-06-13T17:51:50-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 12, 2019 at 8:29 p.m. PDT, we identified a problem with imports that caused some channels to update slowly and prevented channel data from loading properly. We made some changes to resolve the issue and we called the all clear on June 13, 2019 at 12:37 p.m. PDT."
      },
      {
        "date_created": "2019-06-13T13:01:07-07:00",
        "body": "We\u0027re happy to report that we have the all clear, and folks should no longer be experiencing any slowness or missing channel data. Thanks so much for your patience while we got this fixed up."
      },
      {
        "date_created": "2019-06-12T11:27:23-07:00",
        "body": "We’ve identified the root cause of the issue, and are working on a fix. We’ll update here once we’re all clear! Our apologies for any disruption in the meantime. "
      },
      {
        "date_created": "2019-06-12T09:10:37-07:00",
        "body": "We\u0027ve received reports that some customers may be experiencing slowness or temporarily missing channel data. We\u0027re looking into the issue and will report back once we have more information to share."
      },
      {
        "date_created": "2019-06-12T09:02:47-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 699,
    "date_created": "2019-06-11T18:49:04-07:00",
    "date_updated": "2019-06-12T18:46:45-07:00",
    "title": "Some Org Owners are unable to access their Admin dashboard",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/5294e9018c055d0f",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-06-12T18:46:45-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 11, 2019 at 2:00 p.m. PDT a change to the search servers caused an issue where some Org Owners were unable to access the Admin Dashboard. We launched an investigation and resolved the issue on June 12, 2019 at 12:15 a.m. PDT."
      },
      {
        "date_created": "2019-06-12T00:21:50-07:00",
        "body": "We come bearing good news! All Org Owners should be able to access their Admin dashboard once more. To all those affected, we truly appreciate you sticking with us through that. We are doing all we can to prevent this from happening in future."
      },
      {
        "date_created": "2019-06-12T00:00:47-07:00",
        "body": "Things are looking up though we are not out of the woods yet and we don\u0027t want to get ahead of ourselves."
      },
      {
        "date_created": "2019-06-11T23:30:20-07:00",
        "body": "It appears that we were a little quick to confirm the issue had been isolated, sadly. Our changes didn\u0027t have the desired effect. Sorry for that. We\u0027ll keep you updated as we know more."
      },
      {
        "date_created": "2019-06-11T22:40:51-07:00",
        "body": "We\u0027ve isolated the problem and are working hard to restore these Admin dashboards. Thanks again for holding tight."
      },
      {
        "date_created": "2019-06-11T21:50:26-07:00",
        "body": "Our engineers are still looking into what’s causing the issues with the Admin dashboard for Org Owners. We\u0027ll continue to update you on our progress."
      },
      {
        "date_created": "2019-06-11T18:49:04-07:00",
        "body": "We\u0027re looking into why some Org Owners are having trouble accessing their Admin dashboard. Apologies for this hassle."
      }
    ]
  },
  {
    "id": 696,
    "date_created": "2019-06-10T11:14:52-07:00",
    "date_updated": "2019-06-11T13:30:11-07:00",
    "title": "Calls are not working for some customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/4fce0d39701f1a10",
    "services": [
      "Calls"
    ],
    "notes": [
      {
        "date_created": "2019-06-11T13:30:11-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 10th 2019 from 9:20am a.m. PDT - 1:33 p.m. PDT, all Slack Call features were unavailable for customers. A change occurred during a system update that made certain credentials unavailable to Slack servers, which caused the outage. Once the correct credentials were provided, all customers could successfully make calls again in Slack. At 1:33 p.m. PDT the issue was resolved."
      },
      {
        "date_created": "2019-06-10T14:19:11-07:00",
        "body": "Great news! Calls are working again. We\u0027re very sorry for the disruption and appreciate you standing by while we got this fixed up."
      },
      {
        "date_created": "2019-06-10T13:28:15-07:00",
        "body": "We\u0027ve identified the problem and we’re working on a fix to get Calls working again. More details to come as they become available."
      },
      {
        "date_created": "2019-06-10T12:46:35-07:00",
        "body": "Our team is still looking into the trouble folks are having with Calls. We\u0027ll continue to update you on our progress."
      },
      {
        "date_created": "2019-06-10T12:16:34-07:00",
        "body": "We\u0027re still exploring possible fixes for this issue. We apologize for the disruption and we hope to be back to normal soon."
      },
      {
        "date_created": "2019-06-10T11:45:51-07:00",
        "body": "We\u0027re still trying to pin down the root cause of this Calls issue. We hope to bring some good news soon and appreciate your patience."
      },
      {
        "date_created": "2019-06-10T11:14:52-07:00",
        "body": "Some people may be seeing issues with Slack Calls. We’re on the case and will be back with more details soon. Thank you for your patience in the meantime."
      }
    ]
  },
  {
    "id": 695,
    "date_created": "2019-06-10T10:31:49-07:00",
    "date_updated": "2019-06-11T10:52:40-07:00",
    "title": "Trouble loading channels",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/e14fc601026b6e47",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-06-11T10:52:40-07:00",
        "body": "Issue Summary:\r\n\r\nOn 10 June, 2019 at 9:40 a.m. PDT, we deployed a version to our desktop app that caused a sudden increase in the number of connections to our servers. These connections were rate-limited by Slack’s servers in order to protect themselves. During this time, some customers were unable to load their workspaces, including channels and messages. We launched an investigation, but the system recovered soon after, allowing people to reconnect to Slack. At 10:56 a.m. PDT the issue was resolved."
      },
      {
        "date_created": "2019-06-10T10:59:40-07:00",
        "body": "We\u0027re happy to report that we\u0027re in the clear and everybody should be able to access their channels again. Sorry for the disruption, and thank you for bearing with us while we worked to fix things up."
      },
      {
        "date_created": "2019-06-10T10:31:49-07:00",
        "body": "Some folks may be having trouble loading their channels in Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 697,
    "date_created": "2019-06-10T13:03:03-07:00",
    "date_updated": "2019-06-11T08:43:32-07:00",
    "title": "We’re investigating an issue with the Outlook Calendar Integration",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/58fa1527247724a5",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-06-11T08:43:32-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 10, 2019 at 11:30 a.m. PDT, we received an unexpected increase in the number of attempts to sign up for the Outlook Calendar app. This caused an outage of the application, resulting in degraded functionality and some new sign-ups failing. At 2:22 p.m. PDT, we increased the load capacity. This resolved the issue and everything was running smoothly again by 2:50 p.m. PDT. Going forward, we will review our scaling policy to ensure this doesn’t happen again."
      },
      {
        "date_created": "2019-06-10T15:00:32-07:00",
        "body": "Good news: Outlook calendar integrations are working properly for everyone again. We\u0027re sorry for any inconvenience here, and appreciate you sticking with us."
      },
      {
        "date_created": "2019-06-10T13:33:09-07:00",
        "body": "Our engineers are still working on a fix for the `/ocal` integration. Unfortunately, interaction with the app is also broken in addition to the trouble with installation. Thanks for your patience as we get things back to normal!"
      },
      {
        "date_created": "2019-06-10T13:03:03-07:00",
        "body": "Some users are seeing `Server Error` page when trying to install the Outlook Calendar App. We are aware and will update as we know more.  Thanks for bearing with us!"
      }
    ]
  },
  {
    "id": 694,
    "date_created": "2019-06-10T01:26:18-07:00",
    "date_updated": "2019-06-10T15:41:08-07:00",
    "title": "Users are unable to create workspaces if the name includes CJK characters",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/19c2d10cb03dedcb",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-06-10T15:41:08-07:00",
        "body": "Issue Summary: \r\n\r\nOn June 7, 2019, we rolled out an update to the workspace creation flow that contained a bug. This resulted in customers receiving an error message when creating a new team if the workspace name contained any Chinese, Japanese, or Korean characters. On June 10, 2019 at 3:12 a.m. PDT, we deployed the fix and customers were able to create new teams again."
      },
      {
        "date_created": "2019-06-10T03:21:20-07:00",
        "body": "The problem whereby users were unable to create workspaces successfully when using CJK characters in the workspace name, has been resolved. Thank you for your patience. If you are still having trouble in this area, please drop us a line at feedback@slack.com."
      },
      {
        "date_created": "2019-06-10T02:37:03-07:00",
        "body": "We have identified the cause of the trouble users are facing when creating a workspace using CJK characters. We are actively working on a resolution. Thanks for sticking with us."
      },
      {
        "date_created": "2019-06-10T02:08:00-07:00",
        "body": "We are still working to resolve the issue whereby users are unable to create workspaces when using CJK characters. For now, those impacted can work around this problem by creating a temporary workspace name excluding CJK characters, which can then be changed when this problem has been resolved."
      },
      {
        "date_created": "2019-06-10T01:37:13-07:00",
        "body": "Users are currently facing trouble creating new Slack workspaces, if the workspace name includes CJK characters. We are on the case, and apologise for the inconvenience."
      },
      {
        "date_created": "2019-06-10T01:26:18-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 698,
    "date_created": "2019-06-10T13:59:25-07:00",
    "date_updated": "2019-06-10T14:58:08-07:00",
    "title": "We are seeing some issues with webhooks",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/e1a2cd3456e78130",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-06-10T14:58:08-07:00",
        "body": "We\u0027ve determined unusual activity with webhooks was a minor issue and are handling these on a case by case basis. Thanks for your understanding!"
      },
      {
        "date_created": "2019-06-10T13:59:25-07:00",
        "body": "Some workspaces may be receiving permission errors when attempting to post to incoming webhooks. We are aware of the problem and are actively working to fix it."
      }
    ]
  },
  {
    "id": 692,
    "date_created": "2019-06-07T04:03:59-07:00",
    "date_updated": "2019-06-07T17:09:20-07:00",
    "title": "Some people may be unable to make changes to Twitter configurations",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/d4a3125966fc6455",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-06-07T17:09:20-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 7, 2019, we became aware that some people were unable to modify existing Twitter configurations. Upon investigation, we saw that an internal update was not running as expected. We sent out a fix at 12:57 p.m. PDT to resolve the issue, and after confirming the fix was successful, we called the all clear at 1:46 p.m. PDT."
      },
      {
        "date_created": "2019-06-07T13:55:52-07:00",
        "body": "We\u0027re happy to report that the Twitter integration is working for everybody again. Thanks for your patience while we worked to get this fixed."
      },
      {
        "date_created": "2019-06-07T06:19:59-07:00",
        "body": "Our developers confirmed the problem only affects some new configurations of our Twitter app. Most instances still work and we\u0027re working to fix the affected ones."
      },
      {
        "date_created": "2019-06-07T05:33:59-07:00",
        "body": "We don\u0027t have new details yet but we\u0027re still trying to pin down the problems with our Twitter integration. We appreciate the patience."
      },
      {
        "date_created": "2019-06-07T05:03:59-07:00",
        "body": "We\u0027re still working to narrow down the cause of some instances of Slack\u0027s Twitter app not working."
      },
      {
        "date_created": "2019-06-07T04:33:59-07:00",
        "body": "We\u0027re still investigating the problem causing tweets to not be shared into Slack through our Twitter app."
      },
      {
        "date_created": "2019-06-07T04:03:59-07:00",
        "body": "We received reports of our Twitter integration not working. Our team is on the case. Apologies for the disruption."
      }
    ]
  },
  {
    "id": 693,
    "date_created": "2019-06-07T10:25:13-07:00",
    "date_updated": "2019-06-07T16:57:17-07:00",
    "title": "Some people may be unable to sign into Slack",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/064071cfa955e4df",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-06-07T16:57:17-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 7, 2019 at 9:27 a.m. PDT, we experienced an issue with our cloud service provider. We believe this issue resulted in some people experiencing a brief connectivity blip as well as having trouble signing in to their workspaces. We made some changes to resolve the issue, and we called the all clear at 11:09 a.m. PDT."
      },
      {
        "date_created": "2019-06-07T11:12:20-07:00",
        "body": "We\u0027ve got good news: we\u0027re in the clear and everyone should be able to log in again. We\u0027re sorry for any trouble this caused, and thank you for bearing with us."
      },
      {
        "date_created": "2019-06-07T10:25:13-07:00",
        "body": "We’ve heard reports that some folks are having trouble logging into Slack. Our engineers are on the case and we\u0027ll keep you posted on any updates. Thanks for your patience in the meantime."
      }
    ]
  },
  {
    "id": 688,
    "date_created": "2019-05-31T18:58:48-07:00",
    "date_updated": "2019-06-05T18:29:39-07:00",
    "title": "Some customers are unable to start tutorials from Slack Foundry",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/298c29dc54dfacb0",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-06-05T18:29:39-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 31, 2019 at 9:47 a.m. PDT, we started receiving reports of some customers being unable to start tutorials in the Slack Foundry app. By 6:01 p.m. PDT, we identified that only new customers were unable to start tutorials. By 7:46 p.m. PDT, we pushed a fix to address the issue and by 7:58 p.m. PDT, we were able to call the all clear."
      },
      {
        "date_created": "2019-05-31T20:16:34-07:00",
        "body": "We\u0027re happy to report that Slack Foundry tutorials are working again. If you were affected, please type \u0027help reset\u0027 in the Slack Foundry bot or reinstall Slack Foundry to get started. We\u0027re sorry for the disruption this caused."
      },
      {
        "date_created": "2019-05-31T19:07:02-07:00",
        "body": "Some of our customers are having trouble starting tutorials from Slack Foundry. We\u0027re looking into this and we\u0027ll provide more information as soon as we have it. Thanks for bearing with us."
      },
      {
        "date_created": "2019-05-31T18:58:48-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 691,
    "date_created": "2019-06-04T19:47:02-07:00",
    "date_updated": "2019-06-04T22:47:59-07:00",
    "title": "Some people having trouble creating workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/cc10ce621d8310d5",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-06-04T22:47:59-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 3rd 2019 at 4:55 p.m. PDT, we began to incrementally roll out a small change which inadvertently resulted in some customers not being able to create workspaces.\r\n\r\nOn June 4th at 5:37 p.m. PDT, we received external reports of some customers experiencing the issue and we began to investigate. We were able to fix the workspace creation issue by rolling back the change. By June 4th 8:13 p.m. PDT customers could create workspaces again and we called the all clear."
      },
      {
        "date_created": "2019-06-04T20:54:26-07:00",
        "body": "We come bearing good news! Everyone should be able to create workspaces once more. We\u0027re sorry for all that hassle and appreciate your patience while we got that sorted."
      },
      {
        "date_created": "2019-06-04T20:24:09-07:00",
        "body": "Our team is still investigating though we’re on the right track towards a solution. We hope to have more good news to share shortly."
      },
      {
        "date_created": "2019-06-04T19:53:11-07:00",
        "body": "We are investigating why some customers are having trouble creating workspaces. Please bear with us."
      },
      {
        "date_created": "2019-06-04T19:47:02-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 690,
    "date_created": "2019-06-03T15:20:39-07:00",
    "date_updated": "2019-06-03T19:39:15-07:00",
    "title": "We\u0027re looking into issues with Search",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/77da3f99a44b3112",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-06-03T19:39:15-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 3, 2019 from 2:53 p.m. PDT to 3:24 p.m. PDT, message searches failed. We launched an investigation and identified a performance issue in part of the search infrastructure. A restart resolved the issue. \r\n\r\nWe then monitored the on-going behavior and called the all clear at 5:00 p.m. PDT.\r\n\r\nWe’re working to ensure this doesn’t happen again in the future."
      },
      {
        "date_created": "2019-06-03T17:09:12-07:00",
        "body": "We are confident that search is working properly once more for all users. Thank you for your patience!"
      },
      {
        "date_created": "2019-06-03T16:04:10-07:00",
        "body": "We are continuing to look into the issue, but search should be working once more for everyone."
      },
      {
        "date_created": "2019-06-03T15:20:39-07:00",
        "body": "Search is working intermittently for some customers. We are currently investigating the cause and will update as soon as we know more."
      }
    ]
  },
  {
    "id": 689,
    "date_created": "2019-06-02T16:02:52-07:00",
    "date_updated": "2019-06-02T18:15:20-07:00",
    "title": "Account and invitation emails failing to deliver",
    "type": "notice",
    "status": "resolved",
    "url": "https://status.slack.com/2019-06/45360b89ff33245d",
    "services": [
      "Login/SSO"
    ],
    "notes": [
      {
        "date_created": "2019-06-02T18:15:20-07:00",
        "body": "Issue Summary:\r\n\r\nOn June 2, 2019 from 12:53 p.m. PDT to 4:00 p.m. PDT, a network congestion issue affected one of our email services. At 1:29 p.m., we started to receive reports from customers that emails were not arriving and launched an internal investigation. Once we established the issue was with an external provider, we monitored the situation until the issue was resolved. We called the all clear at 5:11 p.m. PDT after customers confirmed emails were arriving as expected again."
      },
      {
        "date_created": "2019-06-02T17:24:59-07:00",
        "body": "We\u0027ve received confirmation that email services have been restored. If you were unable to send or receive a Slack-related email during this time, please try again now. Thanks for bearing with us."
      },
      {
        "date_created": "2019-06-02T16:02:52-07:00",
        "body": "We have received reports of workspace/account creation and email invitation emails failing to deliver, and believe the issue is associated with an email provider outage. We apologize if you\u0027re affected. We\u0027ll update here as soon as we have more information."
      }
    ]
  },
  {
    "id": 687,
    "date_created": "2019-05-23T15:22:53-07:00",
    "date_updated": "2019-05-24T00:52:08-07:00",
    "title": "Some customers are unable to preview certain files in Slack",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/711a15119eb5023c",
    "services": [
      "Posts/Files"
    ],
    "notes": [
      {
        "date_created": "2019-05-24T00:52:08-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 22, 2019 at 3:22 p.m. PDT we released a change that unexpectedly caused previews to fail for certain types of files. The issue was identified and a fix was released shortly after, and by 11:39 p.m. PDT previews were functioning as expected once again.\r\n\r\nIf any particular files still cannot be previewed, you may need to re-upload them. Please note that affected files can still be downloaded, but the preview may not be available until re-uploaded."
      },
      {
        "date_created": "2019-05-24T00:03:55-07:00",
        "body": "We’re happy to report that file previews are up and running again. For those still experiencing issues, you may need to re-upload the affected files in order to fix the preview. We’re sorry for the trouble this caused."
      },
      {
        "date_created": "2019-05-23T21:10:19-07:00",
        "body": "Some of our customers are unable to preview certain files on our mobile and desktop apps. We\u0027re currently investigating why this is the case. Sorry for the disruption."
      },
      {
        "date_created": "2019-05-23T15:22:53-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 684,
    "date_created": "2019-05-22T18:38:51-07:00",
    "date_updated": "2019-05-23T18:30:05-07:00",
    "title": "Some customers were unable to @mention user groups",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/983ecc8124f7ed25",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-05-23T18:30:05-07:00",
        "body": "Issue Summary:\r\n\r\nStarting May 22, 2019 at 5:12 p.m PDT till 10:23 a.m PDT on May 23, 2019 a subset of our users were unable to successfully @-mention user groups.\r\n\r\nDuring our investigation we realized these issues were caused by a change made a few days prior. We had enabled a feature on our end that caused a caching issue which affected user groups. Our engineering team then implemented a fix that resolved the issue.\r\n\r\nWe’re hard at work on scoping preventative measures to ensure this doesn’t happen again in the future."
      },
      {
        "date_created": "2019-05-23T10:55:05-07:00",
        "body": "We\u0027ve got good news: we\u0027re in the clear and all @-mentions should now work correctly. We\u0027re sorry for any trouble this caused and please drop us a note at feedback@slack.com if you\u0027re still having issues."
      },
      {
        "date_created": "2019-05-22T20:55:18-07:00",
        "body": "We\u0027re seeing positive signs that user group mentioning is restored for all customers after refreshing Slack. We\u0027ll continue to monitor the issue. Please contact feedback@slack.com if you are still seeing troubles with @-mentions."
      },
      {
        "date_created": "2019-05-22T20:25:40-07:00",
        "body": "We\u0027ve identified the issue and are working to restore the ability to @mention user groups for all customers. If you are affected, please try refreshing Slack (Ctrl+R or Cmd+R) to see these changes."
      },
      {
        "date_created": "2019-05-22T19:47:06-07:00",
        "body": "No new updates to share, but our teams are still digging into why some customers cannot @mention user groups."
      },
      {
        "date_created": "2019-05-22T19:14:34-07:00",
        "body": "We\u0027re continuing to investigate the issue with user groups, but we don’t have new information just yet. Thanks for bearing with us."
      },
      {
        "date_created": "2019-05-22T18:44:12-07:00",
        "body": "Some of our customers are unable to @-mention user groups in their workspaces. We\u0027re currently looking into this, and we\u0027ll keep you posted when we find out more. We\u0027re sorry for the disruption."
      },
      {
        "date_created": "2019-05-22T18:38:51-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 686,
    "date_created": "2019-05-23T09:32:06-07:00",
    "date_updated": "2019-05-23T12:22:43-07:00",
    "title": "Apps may not be loading properly",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/d697697496498250",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-05-23T12:22:43-07:00",
        "body": "We\u0027re happy to report that we\u0027re in the clear. Our apologies for any inconvenience this may have caused. If you continue to experience troubles with apps timing out, please drop us a note at feedback@slack.com."
      },
      {
        "date_created": "2019-05-23T09:50:29-07:00",
        "body": "We\u0027re looking into reports that some applications from our App Directory are timing out and not loading properly. We\u0027ll keep you updated as we know more."
      },
      {
        "date_created": "2019-05-23T09:32:06-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 685,
    "date_created": "2019-05-23T06:48:13-07:00",
    "date_updated": "2019-05-23T11:07:22-07:00",
    "title": "Android users are not able to sign in with SAML",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/49632f2d93a9482a",
    "services": [
      "Login/SSO"
    ],
    "notes": [
      {
        "date_created": "2019-05-23T11:07:22-07:00",
        "body": "We\u0027re seeing some positive signs that people are able to login with SAML on Android. If you\u0027re still having trouble, please let us know at feedback@slack.com."
      },
      {
        "date_created": "2019-05-23T06:59:20-07:00",
        "body": "We\u0027ve noticed some log in issues with Android users who are not able to log into Slack using SAML. We\u0027re digging into the root cause, and will keep things updated as we know more."
      },
      {
        "date_created": "2019-05-23T06:48:13-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 683,
    "date_created": "2019-05-22T09:57:05-07:00",
    "date_updated": "2019-05-22T12:59:59-07:00",
    "title": "Snippet uploads not working for some workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/648af96e02501598",
    "services": [
      "Posts/Files"
    ],
    "notes": [
      {
        "date_created": "2019-05-22T12:59:59-07:00",
        "body": "The issue with snippet uploads for some workspaces has been resolved! Thank you for your patience while we sorted it out."
      },
      {
        "date_created": "2019-05-22T09:57:05-07:00",
        "body": "We\u0027re investigating reports that snippets aren\u0027t uploading for some workspaces."
      }
    ]
  },
  {
    "id": 681,
    "date_created": "2019-05-17T11:14:54-07:00",
    "date_updated": "2019-05-21T15:50:27-07:00",
    "title": "Some people are experiencing difficulty connecting to Slack.",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/e35727623879588b",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-05-21T15:50:27-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 17th, 2019 at 10:22 a.m. PDT, Slack experienced an issue that prevented some customers from connecting to a workspace or sending messages. At 11:23 a.m. PDT, customers were able to connect successfully again.\r\n\r\nWe’re actively investigating the root cause of this issue so that it doesn’t happen in the future. Should more information become available, we will share another update."
      },
      {
        "date_created": "2019-05-17T12:04:27-07:00",
        "body": "We\u0027ve got good news: we\u0027re in the clear and everyone should be able to connect again. We\u0027re sorry for any interruption to your day. Thanks for sticking with us."
      },
      {
        "date_created": "2019-05-17T11:49:25-07:00",
        "body": "Our team is still investigating, but we’re on the right track towards a fix. We hope to have more good news to share shortly."
      },
      {
        "date_created": "2019-05-17T11:19:30-07:00",
        "body": "We’ve heard reports that some people are having trouble connecting to Slack. Our engineers are on the case and we\u0027ll keep you posted on any updates. Thanks for your patience."
      },
      {
        "date_created": "2019-05-17T11:14:54-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 682,
    "date_created": "2019-05-20T15:48:54-07:00",
    "date_updated": "2019-05-20T20:06:08-07:00",
    "title": "Some users may be unable to install or update apps",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/85e848ed80999c77",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-05-20T20:06:08-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 20, 2019 at 3:07 p.m. PDT we deployed a change, which resulted in failing installations and re-installations of some apps.\r\n\r\nAt 4:05 p.m. PDT we deployed the fix for this issue. By 4:46 p.m. PDT we verified users were able to successfully install or re-install apps and called the all clear."
      },
      {
        "date_created": "2019-05-20T16:48:52-07:00",
        "body": "Everyone should now be able to install and update apps once more. Sorry for the hassle and thanks for sticking with us."
      },
      {
        "date_created": "2019-05-20T15:48:54-07:00",
        "body": "We\u0027re investigating an issue with installing and updating apps. Thanks for your patience as we work things out!"
      }
    ]
  },
  {
    "id": 680,
    "date_created": "2019-05-17T12:34:00-07:00",
    "date_updated": "2019-05-17T12:34:00-07:00",
    "title": "Twitter integration not working for all customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/3c170b31b0895492",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-05-17T12:34:00-07:00",
        "body": "On May 17, 2019 at 3:00 a.m., we made a change that reconfigured numerous services. This unexpectedly caused the Twitter subscription service to fail posting any new tweets into channels and DMs for all customers. We investigated this, reset the service, and confirmed it was posting correctly again by 8:34 a.m. PDT on May 17, 2019."
      }
    ]
  },
  {
    "id": 679,
    "date_created": "2019-05-14T22:54:46-07:00",
    "date_updated": "2019-05-15T00:35:02-07:00",
    "title": "Problems with archiving channels",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/eef3a5d2f9253bbc",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-05-15T00:35:02-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 14, 2019 at approximately 2:07 p.m. PDT a change was made to the archive channel functionality. This change caused non-archived channels to appear as archived incorrectly. We investigated this with our team, discovered the problem, and resolved the issue at 12:16 a.m. PDT on May 15."
      },
      {
        "date_created": "2019-05-15T00:18:42-07:00",
        "body": "We’ve made some changes and archiving channels should now work correctly once more. If you continue to have problems after refreshing your app (Cmd or Ctrl + R) please let us know at feedback@slack.com. Apologies for that disruption to your day."
      },
      {
        "date_created": "2019-05-15T00:01:26-07:00",
        "body": "No new information just yet but we hope to have good news to share soon."
      },
      {
        "date_created": "2019-05-14T23:31:17-07:00",
        "body": "We\u0027ve been monitoring things and are seeing positive signs though we\u0027re not out of the woods yet. Thanks for your patience."
      },
      {
        "date_created": "2019-05-14T22:54:46-07:00",
        "body": "We’re seeing issues with archiving channels whereby non-archived channels are showing as archived. We’re working to get this rectified. In the meantime, refreshing the app (Cmd or Ctrl + R) should help clear this archive message from the channel view."
      }
    ]
  },
  {
    "id": 677,
    "date_created": "2019-05-12T18:27:19-07:00",
    "date_updated": "2019-05-12T21:42:32-07:00",
    "title": "Some customers are not seeing updates from the Twitter integration",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/3cae88d45ecf1861",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-05-12T21:42:32-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 10, 2019 at approximately 4:00 p.m. PDT, some users were unable to receive new updates via their Twitter integrations. This was caused by an internal update not running as expected. Manually re-running this update resolved the issue and Twitter integrations started working as expected at 7:58 p.m. PDT on May 12, 2019."
      },
      {
        "date_created": "2019-05-12T20:05:11-07:00",
        "body": "We\u0027re happy to report that customers should be seeing updated Tweets from the Twitter integration once again. Sorry for the trouble this caused."
      },
      {
        "date_created": "2019-05-12T18:33:28-07:00",
        "body": "Some of our customers are unable to see updates from the Twitter app integration. We\u0027re currently looking into this, and we\u0027ll keep you posted as we receive more information."
      },
      {
        "date_created": "2019-05-12T18:27:19-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 676,
    "date_created": "2019-05-09T18:27:57-07:00",
    "date_updated": "2019-05-10T13:07:14-07:00",
    "title": "Customers unable to perform actions through the Manage Members page on mobile",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/cee871f925eead1f",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-05-10T13:07:14-07:00",
        "body": "On May 9, 2019 at 4:40 p.m. PDT, a change to the way our website is formatted was released. As a result, Workspace Admins and Owners using screens less than 1185 pixels wide were unable to see and use some parts of the Manage members page. We investigated this with our team, discovered the problem and resolved the issue at 11:06 a.m. PDT on May 10."
      },
      {
        "date_created": "2019-05-10T11:09:31-07:00",
        "body": "We\u0027re happy to report that we’ve resolved issues affecting the  ‘Manage members’ page on mobile web browsers. Thanks for sticking with us!"
      },
      {
        "date_created": "2019-05-09T19:43:13-07:00",
        "body": "We\u0027re still looking into the \u0027Manage members\u0027 page issue on mobile web browsers. For Workspace Owners/Admins, please perform these actions on a desktop browser in the meantime. We\u0027ll confirm when things are back to normal."
      },
      {
        "date_created": "2019-05-09T18:27:57-07:00",
        "body": "Some of our customers are unable to take actions on the \u0027Manage members\u0027 page through mobile web browsers. The \u0027Manage members\u0027 page is fully functional via desktop web browsers. We\u0027re currently investigating, and we\u0027ll keep you posted as soon as we have more information. We\u0027re sorry for the trouble."
      }
    ]
  },
  {
    "id": 675,
    "date_created": "2019-05-09T16:25:41-07:00",
    "date_updated": "2019-05-09T19:50:10-07:00",
    "title": "Issues authenticating or installing apps to workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/5a669d202f61053d",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-05-09T19:50:10-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 9, 2019 at 3:15 p.m. PDT we released a change, which unexpectedly prevented users from being able to authorize and install apps to their workspaces. This change was reverted, and by 5:33 p.m. PDT app authorization was working as expected once again."
      },
      {
        "date_created": "2019-05-09T17:38:44-07:00",
        "body": "We\u0027re happy to report that customers are able to authenticate and install apps to workspaces again. We apologise for the delay in getting these apps up and running."
      },
      {
        "date_created": "2019-05-09T16:25:41-07:00",
        "body": "Some customers may be experiencing issues authenticating or installing apps to their workspaces. We are investigating, and we\u0027re very sorry for the disruption."
      }
    ]
  },
  {
    "id": 672,
    "date_created": "2019-05-06T00:51:10-07:00",
    "date_updated": "2019-05-06T23:48:52-07:00",
    "title": "Issues with iOS message history in new channels",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/33bde1e19198fdb2",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-05-06T23:48:52-07:00",
        "body": "Issue Summary:\r\n\r\nOn April 23, 2019, an update was rolled out to our iOS app, which contained a bug that caused some recent channel message history to disappear. We\u0027ve fixed the bug and submitted an updated app version to the App Store. The updated app version will start rolling out today."
      },
      {
        "date_created": "2019-05-06T10:28:38-07:00",
        "body": "We\u0027ve honed in on the issues with iOS message history and submitted a fix which will be made available through an update to the App Store in the next few days. If you\u0027re still seeing any trouble with viewing channel history after the update, please write into feedback@slack.com."
      },
      {
        "date_created": "2019-05-06T00:51:10-07:00",
        "body": "Customers using the iOS app may be unable to view the full message history of recently created channels. We\u0027re on the case, and we apologize for the disruption as we look in to this."
      }
    ]
  },
  {
    "id": 674,
    "date_created": "2019-05-06T18:44:20-07:00",
    "date_updated": "2019-05-06T23:46:48-07:00",
    "title": "Issues setting up new instances of the Twitter integration",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/e5eee588c7fa7f36",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-05-06T23:46:48-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 6, 2019 at 10:06 a.m. PDT, we deactivated an old configuration that used to handle our Twitter message services, which caused new attempts to create Twitter integrations to fail. The root cause of the problem was found at 7:21 p.m. PDT and we restored the service without any loss of Twitter messages or subscriptions. The all clear was called at 7:27 p.m. PDT."
      },
      {
        "date_created": "2019-05-06T19:35:50-07:00",
        "body": "We have resolved the problem with setting up new instances of the Twitter integration, and it should all be running smoothly now. Apologies again for the trouble. \r\n\r\nIf you have any further hassles, please let us know at feedback@slack.com."
      },
      {
        "date_created": "2019-05-06T18:44:20-07:00",
        "body": "Customers are unable to set up new instances of the Twitter integration at the moment. We\u0027ve got all hands on deck as we investigate, and we\u0027re very sorry for the disruption."
      }
    ]
  },
  {
    "id": 673,
    "date_created": "2019-05-06T16:38:23-07:00",
    "date_updated": "2019-05-06T23:45:25-07:00",
    "title": "Trouble using slash commands",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/e81238250f5a1abd",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-05-06T23:45:25-07:00",
        "body": "Issue Summary: \r\n\r\nOn May 6, 2019 at 3:04 p.m. PDT, we received a report that slash commands were failing. An internal investigation was launched and we determined that a recent code change had introduced a bug. We made the required code change, which allowed customers to use all slash commands again. The all clear was called at 5:32 p.m. PDT."
      },
      {
        "date_created": "2019-05-06T17:36:04-07:00",
        "body": "Everyone should be able to use slash commands as expected once again. Thank you for bearing with us while we got to the bottom of this. We\u0027re very sorry for the trouble."
      },
      {
        "date_created": "2019-05-06T16:38:23-07:00",
        "body": "Some folks may be unable to use slash commands. We’re currently investigating and will let you know as soon as we have more news to share. We apologize for any disruption to your workflow."
      }
    ]
  },
  {
    "id": 671,
    "date_created": "2019-05-05T17:23:26-07:00",
    "date_updated": "2019-05-05T23:27:27-07:00",
    "title": "Some people are seeing menus in different languages",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/59903f04c371877e",
    "services": [],
    "notes": [
      {
        "date_created": "2019-05-05T23:27:27-07:00",
        "body": "Issue Summary: \r\n\r\nOn May 3, 2019 at 11:15 p.m. PDT, we made a change to one of our build and release processes, which resulted in pre-rendered templates being written into an incorrect location on our servers. This affected our language support and caused some elements within Slack to fall back to the default language (English). After identifying the error, a fix was released and the issue was resolved at 8:15 p.m. PDT on May 5, 2019. \r\n\r\nCustomers may need to refresh Slack by pressing Shift+Cmd+R (Mac), or Shift+Ctrl+R (Windows), or by clearing the desktop app cache, for the fix to take effect."
      },
      {
        "date_created": "2019-05-05T20:21:08-07:00",
        "body": "We\u0027ve resolved the issue with different languages appearing in menus. To see these changes, please refresh Slack with Cmd+Shift+R (Mac) or Ctrl+Shift+R (Windows/Linux). If the hard refresh does not help, please open Slack, then go to \u0027Help\u0027 \u003e \u0027Troubleshooting\u0027 \u003e \u0027Clear Cache and Restart\u0027.  We apologise for the trouble this caused."
      },
      {
        "date_created": "2019-05-05T19:58:39-07:00",
        "body": "We\u0027ve identified the cause of different languages displaying and we\u0027re actively working to fix this. Thanks for your patience."
      },
      {
        "date_created": "2019-05-05T19:23:02-07:00",
        "body": "We\u0027ve found that the issue with different languages appearing in menus occurs when changing preferences to non-English languages. We\u0027re still investigating and we\u0027ll share more news shortly."
      },
      {
        "date_created": "2019-05-05T17:39:34-07:00",
        "body": "Some customers may be seeing menu options in languages other than their selected language. We\u0027re sorry for the disruption and we\u0027ll be keeping you posted."
      },
      {
        "date_created": "2019-05-05T17:23:26-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 670,
    "date_created": "2019-05-02T13:09:58-07:00",
    "date_updated": "2019-05-02T17:17:36-07:00",
    "title": "Some people are having trouble connecting to Slack",
    "type": "outage",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/6d7541f932dd628c",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-05-02T17:17:36-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 2, 2019 beginning at 1:02 p.m. PDT, we began to incrementally roll out a small change that inadvertently resulted in some customers being unable to use Slack.\r\n\r\nThe change was rolled back, and the issue resolved at 1:41 p.m. PDT."
      },
      {
        "date_created": "2019-05-02T13:44:50-07:00",
        "body": "We\u0027re seeing some positive signs and people should be able to connect again. However, if you\u0027re still having issues, please let us know at feedback@slack.com."
      },
      {
        "date_created": "2019-05-02T13:09:58-07:00",
        "body": "We’re actively looking into an issue with Slack — we’ll be back with more information shortly. Thank you for your patience, and sorry for the disruption."
      }
    ]
  },
  {
    "id": 668,
    "date_created": "2019-05-01T16:33:41-07:00",
    "date_updated": "2019-05-02T12:17:38-07:00",
    "title": "Issues with search and the Quick Switcher for Grid customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/4f15f210d1493bea",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-05-02T12:17:38-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 1st, 2019 at 3:51PM PDT an update was released which caused the Quick Switcher and other dialogue boxes with \"Autocomplete\" functionality to fail for some users. After identifying the error, a fix was released and by 5:29PM PDT and all functionality was returned to normal. Users may need to reload Slack by pressing \"command\" (⌘) + R on Mac, or \"ctrl\" + R on Windows/Linux for the fix to take effect."
      },
      {
        "date_created": "2019-05-01T17:54:38-07:00",
        "body": "We come bearing good news! Everyone should be able to use search and the Quick Switcher once more. We would advise refreshing the app with cmd or ctrl and R before giving search a try. If you\u0027re running into any trouble after giving that a go please let us know at feedback@slack.com. So sorry for all that hassle."
      },
      {
        "date_created": "2019-05-01T17:42:55-07:00",
        "body": "We\u0027ve made some changes that we believe will resolve these issues with search and the Quick Switcher. We will monitor things and let you know as soon as we know more."
      },
      {
        "date_created": "2019-05-01T17:04:55-07:00",
        "body": "We’re still working to locate the cause of these issues with search and the Quick Switcher for some Grid customers. Thanks for holding tight."
      },
      {
        "date_created": "2019-05-01T16:33:41-07:00",
        "body": "Some folks may be having trouble using the Quick Switcher (Ctrl/Cmd + K) to search in Slack. We\u0027re on the case and will let you know as soon as we have more news to share. Apologies for any disruption in the meantime."
      }
    ]
  },
  {
    "id": 669,
    "date_created": "2019-05-01T23:22:15-07:00",
    "date_updated": "2019-05-02T02:06:00-07:00",
    "title": "Some customers in the United Arab Emirates may have trouble connecting to Slack",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-05/77b686ba6d54682a",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-05-02T02:06:00-07:00",
        "body": "Issue Summary:\r\n\r\nOn May 1st 2019 at 8:58 p.m PT, we received reports that some customers in the UAE were unable to connect to Slack. We investigated and found that a particular ISP was experiencing DNS issues, and this in turn was preventing connections to Slack. We continued to monitor the situation and by 11:58 p.m. PT all connections were re-established."
      },
      {
        "date_created": "2019-05-02T00:01:03-07:00",
        "body": "All customers should now be able to connect to Slack. Thank you for your patience while we looked into this, we appreciate it."
      },
      {
        "date_created": "2019-05-01T23:22:15-07:00",
        "body": "Some customers in the United Arab Emirates may be experiencing trouble connecting to Slack. We are looking in to this, and we\u0027re terribly sorry for the disruption."
      }
    ]
  },
  {
    "id": 667,
    "date_created": "2019-04-30T20:08:33-07:00",
    "date_updated": "2019-04-30T22:48:57-07:00",
    "title": "Slack Help Centre is inaccessible",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/79e1a9fa65430948",
    "services": [],
    "notes": [
      {
        "date_created": "2019-04-30T22:48:57-07:00",
        "body": "We’ve located the issue and restored the Help Centre once more. Apologies to anyone seeking help during that downtime."
      },
      {
        "date_created": "2019-04-30T20:08:33-07:00",
        "body": "We\u0027re looking into why the Help Centre is currently inaccessible. Please hold tight."
      }
    ]
  },
  {
    "id": 665,
    "date_created": "2019-04-26T13:53:11-07:00",
    "date_updated": "2019-04-29T17:21:34-07:00",
    "title": "People may be unable to see their channel sidebar or some messages",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/90cb31e1032aeab9",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-04-29T17:21:34-07:00",
        "body": "Incident Summary:\r\n\r\nOn April 26th, beginning at 10:45am PDT, some customers had trouble loading parts of the Slack UI including the lefthand sidebar, some messages, and some emojis. We had deployed a small change to the emoji component that resulted in this error affecting some customers.\r\n\r\nThe initial change was updated to correct this error and the issue was resolved for all customers at 3:24pm PDT."
      },
      {
        "date_created": "2019-04-26T15:17:08-07:00",
        "body": "We\u0027re making progress on a fix, and expect that reloading your workspace (Ctrl/Cmd + R) should get everything up and running again. If you\u0027re still experiencing trouble after giving this a try, please let us know at feedback@slack.com."
      },
      {
        "date_created": "2019-04-26T14:35:11-07:00",
        "body": "A small group of folks may be unable to see their channel sidebar or some messages. Thanks again for your patience as we continue to look into this and we\u0027ll be back in a bit with more news."
      },
      {
        "date_created": "2019-04-26T13:53:11-07:00",
        "body": "Some people may be having trouble loading the channel list in their sidebar. We’re currently investigating and will let you know once we have more information. Thank you for your patience in the meantime."
      }
    ]
  },
  {
    "id": 666,
    "date_created": "2019-04-29T13:24:00-07:00",
    "date_updated": "2019-04-29T13:24:00-07:00",
    "title": "Some users are having trouble receiving iOS notifications",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/fdac59fdc2bfd393",
    "services": [],
    "notes": [
      {
        "date_created": "2019-04-29T13:24:00-07:00",
        "body": "Issue Summary:\r\n\r\nOn April 29, 2019, from 10:20 AM PDT to 1:23 PM PDT, a code change caused a small percentage of iOS notifications to fail to send. Upon receiving customer reports, we investigated the issue and reverted the code change. The issue was fully resolved by 1:24 PM PDT."
      }
    ]
  },
  {
    "id": 664,
    "date_created": "2019-04-25T04:12:54-07:00",
    "date_updated": "2019-04-26T04:40:28-07:00",
    "title": "Problems with email ingestion",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/7e9c3fb51c6c0ce6",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-04-26T04:40:28-07:00",
        "body": "At 03:42am PT on April 25th, a bug in one of our services caused the ingestion and processing of emails to fail, leading to dropped or delayed emails across all workspaces.\r\n\r\nOur engineers worked on a fix, and an all clear was called at 05:28am PT."
      },
      {
        "date_created": "2019-04-25T05:38:52-07:00",
        "body": "The issue users were facing receiving emails to Slack has been resolved. Apologies for any hassle this may have caused. Thanks for sticking with us."
      },
      {
        "date_created": "2019-04-25T04:12:54-07:00",
        "body": "Some users may be experiencing trouble receiving emails to Slack. Rest assured that we are on the case, and investigating the cause. Thank you for your patience, and apologies for this inconvenience."
      }
    ]
  },
  {
    "id": 663,
    "date_created": "2019-04-22T16:43:22-07:00",
    "date_updated": "2019-04-22T17:44:59-07:00",
    "title": "Some people may not be able to install the Google Drive app",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/2ee8c6883f0466a7",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-04-22T17:44:59-07:00",
        "body": "We have resolved the installation issues with the Google Drive app, and everyone should be able to install the app as normal now. If you have any further hassles, please reach out to us at feedback@slack.com.\r\nThank you for bearing with us, we appreciate it."
      },
      {
        "date_created": "2019-04-22T16:43:22-07:00",
        "body": "We\u0027ve heard reports that customers are unable to install the Google Drive app. We\u0027re looking into this, and will be back once we have some more news. Thanks for bearing with us in the meantime."
      }
    ]
  },
  {
    "id": 662,
    "date_created": "2019-04-22T14:54:07-07:00",
    "date_updated": "2019-04-22T15:58:33-07:00",
    "title": "Some people are unable to send messages",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/843bac60d5e43888",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-04-22T15:58:33-07:00",
        "body": "We\u0027re happy to report that messaging should be working again. Apologies for the disruption, and thank you for sticking with us."
      },
      {
        "date_created": "2019-04-22T14:54:07-07:00",
        "body": "Some people may be having trouble sending messages in Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 661,
    "date_created": "2019-04-17T17:22:58-07:00",
    "date_updated": "2019-04-18T20:17:18-07:00",
    "title": "Trouble approving app install requests",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/532edf2f9ffa51a5",
    "services": [],
    "notes": [
      {
        "date_created": "2019-04-18T20:17:18-07:00",
        "body": "Issue summary:\r\n\r\nOn April 17th at 1:11 AM PT it was reported that customers were unable to install apps approved from the App Management page. This was caused by a change made on the App Management page at April 11th 2:32 PM PT. Once reported, our team identified the cause of the issue and began to work on a fix. This fix was deployed and full functionality was restored on April 18th at 11:16 AM PT."
      },
      {
        "date_created": "2019-04-18T20:01:28-07:00",
        "body": "Approving app installation requests on the App Management page should now be working again. We\u0027re sorry again for any   inconvenience caused."
      },
      {
        "date_created": "2019-04-17T17:22:58-07:00",
        "body": "We\u0027re investigating an issue where app installation requests cannot be approved from the App Management page if the workspace has the Approved Apps setting enabled. We\u0027re very sorry for the disruption, and we\u0027re working on it. \r\n\r\nFor now, App Admins can approve requests with the Slackbot notification button."
      }
    ]
  },
  {
    "id": 660,
    "date_created": "2019-04-16T12:57:49-07:00",
    "date_updated": "2019-04-16T15:13:33-07:00",
    "title": "Some people are unable to load All Threads",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/8cd3bf5260ef629c",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-04-16T15:13:33-07:00",
        "body": "We\u0027re happy to report people should now be able to load All Threads. We\u0027re sorry for the trouble today. We\u0027ll report back with an Issue Summary shortly."
      },
      {
        "date_created": "2019-04-16T14:13:25-07:00",
        "body": "We\u0027re actively working to get All Threads loading for people again. Thanks for your patience. We\u0027ll share more news shortly."
      },
      {
        "date_created": "2019-04-16T13:46:06-07:00",
        "body": "We\u0027re still looking into trouble some people are having with loading All Threads. We\u0027ll be back with an update soon. In the meantime, you should be able to load All Threads in the mobile app."
      },
      {
        "date_created": "2019-04-16T12:57:49-07:00",
        "body": "Some people are having trouble loading All Threads. We\u0027re currently investigating, and we\u0027ll update you as soon as we have more information. We apologize for the disruption to your day."
      }
    ]
  },
  {
    "id": 659,
    "date_created": "2019-04-12T00:13:03-07:00",
    "date_updated": "2019-04-12T04:30:00-07:00",
    "title": "Enterprise Grid customers unable to invite people to private shared channels",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/9452bdeac0aac27d",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-04-12T04:30:00-07:00",
        "body": "Issue Summary:\r\n\r\nAt 12:54am PT on April 12th, we deployed a change which introduced an issue where Enterprise Grid users were unable to invite members to shared private channels. Our engineers identified the problem and pushed out a fix."
      },
      {
        "date_created": "2019-04-12T03:26:00-07:00",
        "body": "Everything should be working normally again now with invitations to private shared channels on Enterprise Grid."
      },
      {
        "date_created": "2019-04-12T00:53:35-07:00",
        "body": "We\u0027re still looking into the issues with invitations to private shared channels. We don\u0027t have any new information just yet, but we\u0027ll keep you posted."
      },
      {
        "date_created": "2019-04-12T00:22:34-07:00",
        "body": "Some of our Enterprise Grid customers are having trouble inviting their members to private shared channels. We\u0027re currently investigating and will keep you posted. Sorry for the disruption."
      },
      {
        "date_created": "2019-04-12T00:13:03-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 657,
    "date_created": "2019-04-09T13:08:24-07:00",
    "date_updated": "2019-04-09T23:59:14-07:00",
    "title": "Delayed notifications, such as reminder notifications, aren\u0027t working as expected",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/5f9c0799ff701a87",
    "services": [
      "Notifications"
    ],
    "notes": [
      {
        "date_created": "2019-04-09T23:59:14-07:00",
        "body": "Issue Summary:\r\n\r\nOn April 9, 2019 at 12:10 PM PDT, we made a code change that caused specific message notifications, such as those from reminders and calendar events to fail. We investigated the issue and reverted the code change. The issue was fully resolved at 1:34 PM PDT."
      },
      {
        "date_created": "2019-04-09T13:41:25-07:00",
        "body": "We\u0027re happy to report delayed notifications are working as expected. We\u0027re sorry for the disruption to your day, and we\u0027ll report back with an Issue Summary shortly."
      },
      {
        "date_created": "2019-04-09T13:08:24-07:00",
        "body": "We\u0027re investigating trouble with delayed notifications, such as reminder notifications, failing to send. We\u0027ll keep you posted, and we\u0027re sorry for the trouble."
      }
    ]
  },
  {
    "id": 653,
    "date_created": "2019-04-04T18:12:12-07:00",
    "date_updated": "2019-04-08T16:37:24-07:00",
    "title": "Workspace Admins and Owners may be unable to search for some members on the \u0027Manage members\u0027 page",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/af4984d0cfc44a99",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-04-08T16:37:24-07:00",
        "body": "Issue Summary:\r\n\r\nOn April 4th, we received reports from our users that they were unable to find members of their workspace on the Manage Members page. During our investigation, we realized these issues stemmed from a misconfiguration in our database in early March.\r\n\r\nOur engineering team began working on a fix and on April 8th at 10:16am PDT, a new configuration was implemented. This resolved the issue and brought full functionality back to the Manage Members page.\r\n\r\nWe’re currently investigating preventive measures to ensure that this doesn’t happen again in the future. If you’re still running into any issues, please reach out to us at feedback@slack.com."
      },
      {
        "date_created": "2019-04-04T23:26:50-07:00",
        "body": "Our engineers have narrowed down the issues with the \u0027Manage members\u0027 page. If you\u0027re experiencing any troubles with this particular page, please reach out to us at feedback@slack.com."
      },
      {
        "date_created": "2019-04-04T18:12:12-07:00",
        "body": "Workspace Admins and Owners may be unable to search for some members of their workspace on the Manage Members page. We\u0027re investigating, and we\u0027re very sorry for the disruption."
      }
    ]
  },
  {
    "id": 656,
    "date_created": "2019-04-06T16:18:43-07:00",
    "date_updated": "2019-04-07T16:50:07-07:00",
    "title": "Some people are having trouble connecting to Slack",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/0596b02f6bca571c",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-04-07T16:50:07-07:00",
        "body": "Issue Summary:\r\n\r\nOn April 6th at 2:17 PM PDT, a database degraded, which caused some customers to experience trouble connecting to Slack. By 4:44 PM PDT, we had identified the root cause of the issue and our team deployed a change to restore the database, allowing services to recover. Services were fully restored by 5:29 PM PDT.\r\n\r\nOur team is investigating the root cause and working to ensure this doesn’t happen in the future."
      },
      {
        "date_created": "2019-04-06T16:55:54-07:00",
        "body": "Slack should be running smoothly now! Sorry for the interruption to your day, and thanks for your patience."
      },
      {
        "date_created": "2019-04-06T16:18:43-07:00",
        "body": "Slack may be down for some folks. We’re still investigating and will have updates shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 654,
    "date_created": "2019-04-04T18:31:43-07:00",
    "date_updated": "2019-04-05T04:08:40-07:00",
    "title": "Customers are experiencing degraded functionality",
    "type": "outage",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/cd8c3560451f0724",
    "services": [
      "Apps/Integrations/APIs",
      "Workspace/Org Administration",
      "Messaging",
      "Link Previews",
      "Posts/Files"
    ],
    "notes": [
      {
        "date_created": "2019-04-05T04:08:40-07:00",
        "body": "Issue Summary:\r\n\r\nAt 7:25pm PT on April 4th, we changed the configuration for one of our core services which caused it to break. As the majority of our functionalities depend on this service, we faced problems across the board.\r\n\r\nOur engineers worked on a fix, and an all clear was called at 2:39am PT."
      },
      {
        "date_created": "2019-04-05T01:51:17-07:00",
        "body": "We\u0027ve got good news: we\u0027re in the clear and the issue has been fixed. If you don’t automatically reconnect, refresh your workspace using Ctrl/Cmd + R. We\u0027re sorry for any trouble this caused. Thanks for sticking with us."
      },
      {
        "date_created": "2019-04-05T01:08:19-07:00",
        "body": "Sorry for any disruption to your day. Our team is still working to fully resolve the issue. Once we have more information, we\u0027ll be sure to update you!"
      },
      {
        "date_created": "2019-04-05T00:37:45-07:00",
        "body": "We do not have new information to share, but we are still working to make sure our systems are running smoothly."
      },
      {
        "date_created": "2019-04-04T23:54:16-07:00",
        "body": "Our engineers are working to make sure systems are in a healthy state. If you\u0027re still seeing significant issues with Slack functionality, please reach out to us at feedback@slack.com."
      },
      {
        "date_created": "2019-04-04T23:23:44-07:00",
        "body": "We\u0027re continuing our work in the background to ensure things are running as smoothly as possible across all fronts."
      },
      {
        "date_created": "2019-04-04T22:45:54-07:00",
        "body": "We have no new discoveries to share, but we\u0027re keeping a watchful eye on impacts to your experience with these features."
      },
      {
        "date_created": "2019-04-04T22:11:02-07:00",
        "body": "We’re seeing positive signs that functionality is returning to normal, but we still have work to do. Please continue to let us know if you\u0027re experiencing specific issues with these features through feedback@slack.com."
      },
      {
        "date_created": "2019-04-04T21:37:43-07:00",
        "body": "All hands are working to fix this. We\u0027re seeing improvements in certain areas, and we\u0027re continuing our efforts."
      },
      {
        "date_created": "2019-04-04T21:05:39-07:00",
        "body": "We believe we\u0027re on the right track for a solution, but we\u0027re not out of the woods. Thanks for sticking with us."
      },
      {
        "date_created": "2019-04-04T20:32:35-07:00",
        "body": "We don’t have additional information to share, but we\u0027re laser focused on fixing these features. We\u0027ll continue to update you on our progress."
      },
      {
        "date_created": "2019-04-04T20:02:11-07:00",
        "body": "We\u0027ve discovered an issue with the checkout page for workspace upgrades. Our engineers are still looking into this and the other issues. Thanks for bearing with us."
      },
      {
        "date_created": "2019-04-04T19:32:39-07:00",
        "body": "We\u0027re still exploring the cause of these issues and we\u0027ve seen that API calls may be failing as well. We\u0027ll be back in 30 minutes with another update."
      },
      {
        "date_created": "2019-04-04T19:01:54-07:00",
        "body": "We’re still investigating the issues with these key features, especially with messages failing to send. We’re so sorry for the interruption to your day."
      },
      {
        "date_created": "2019-04-04T18:31:43-07:00",
        "body": "All customers may be facing issues with file uploads, unfurls, custom responses and other features. We are actively investigating. Thank you for your patience, and sorry for the disruption."
      }
    ]
  },
  {
    "id": 648,
    "date_created": "2019-03-29T13:13:51-07:00",
    "date_updated": "2019-04-03T23:38:58-07:00",
    "title": "Some people are having trouble connecting to Slack",
    "type": "outage",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/146118a2b0b98ec6",
    "services": [
      "Connections"
    ],
    "notes": [
      {
        "date_created": "2019-04-03T23:38:58-07:00",
        "body": "Issue Summary:\r\n\r\nOn March 29th at 12:47 PM PDT, a database overloaded, which caused some customers to experience trouble connecting to Slack. Our team deployed a change to reduce the load, allowing the database to recover. Customers were able to connect by 1:19 PM PDT."
      },
      {
        "date_created": "2019-03-29T15:53:27-07:00",
        "body": "The affected workspaces should be able to connect now. Thanks again for your patience, and we\u0027re sorry for the disruption today."
      },
      {
        "date_created": "2019-03-29T14:45:21-07:00",
        "body": "If you\u0027re affected by the connectivity issue, we\u0027re starting to see improvements, but we still have some work to do. We\u0027ll let you know when things are working as they should be."
      },
      {
        "date_created": "2019-03-29T14:21:48-07:00",
        "body": "We\u0027re continuing to look into the connectivity issue. Thanks for hanging in there."
      },
      {
        "date_created": "2019-03-29T13:45:37-07:00",
        "body": "We\u0027re still investigating the connectivity issue, but we don\u0027t have additional information just yet. We\u0027ll be back soon with another update."
      },
      {
        "date_created": "2019-03-29T13:13:51-07:00",
        "body": "Some folks are having trouble connecting to Slack. We\u0027re sorry for the disruption, and we\u0027ll update you soon."
      }
    ]
  },
  {
    "id": 650,
    "date_created": "2019-04-03T15:04:17-07:00",
    "date_updated": "2019-04-03T17:27:04-07:00",
    "title": "Issues sending messages when using certain elements of Block Kit",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-04/4e21e966291d547d",
    "services": [
      "Apps/Integrations/APIs"
    ],
    "notes": [
      {
        "date_created": "2019-04-03T17:27:04-07:00",
        "body": "Issue Summary:\r\n\r\nOn April 3 at 1:23 PM PDT, we made a change to our Block Kit framework that prevented apps from using blocks containing several types of elements: specifically, the date picker and most of the select menu elements. The relevant change was identified and addressed at 2:11 PM PDT and we were able to restore these elements at 4:03 PM PDT."
      },
      {
        "date_created": "2019-04-03T16:20:30-07:00",
        "body": "We’ve been given the all-clear! All messages from Block Kit apps should be sending successfully once more. Thanks for sticking with us through that. We really appreciate it."
      },
      {
        "date_created": "2019-04-03T15:04:17-07:00",
        "body": "We’re aware of an issue where messages from apps might not be posted if they contain certain Block Kit elements. Apologies for the disruption, we\u0027re working to resolve this."
      }
    ]
  },
  {
    "id": 647,
    "date_created": "2019-03-29T03:31:27-07:00",
    "date_updated": "2019-03-29T08:03:08-07:00",
    "title": "Trouble with loading channels for some teams",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/e72e12f5a6a8fec0",
    "services": [
      "Messaging",
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-03-29T08:03:08-07:00",
        "body": "While we’re confident this shouldn’t be happening to most folks now, there may be some teams that are still seeing trouble with properly loading channels. Please let us know at feedback@slack.com if you\u0027re experiencing this and we\u0027ll look into it right away."
      },
      {
        "date_created": "2019-03-29T06:52:03-07:00",
        "body": "We\u0027ve got good news: it looks like we’ve isolated the problem, so people should be able to load all channels again. If you\u0027re still experiencing issues, please drop us a line at feedback@slack.com."
      },
      {
        "date_created": "2019-03-29T05:30:03-07:00",
        "body": "Our team is still investigating, but we’re on the right track towards a solution. We hope to have more good news to share shortly."
      },
      {
        "date_created": "2019-03-29T04:30:01-07:00",
        "body": "We really appreciate you sticking with us while we figure out what\u0027s happening here. We know that problems with channels can be a big disruption to your day, so we\u0027ve got all eyes working to fix the issue."
      },
      {
        "date_created": "2019-03-29T04:00:49-07:00",
        "body": "We’re still investigating the issue with channels loading for some workspaces, but we don’t have additional information just yet. We’ll be back in 30 minutes with another update."
      },
      {
        "date_created": "2019-03-29T03:42:20-07:00",
        "body": "Some teams are experiencing difficulties loading the #general channel on their workspace. We\u0027re currently investigating, and we\u0027ll keep you posted as soon as we have more information. We\u0027re sorry for the disruption."
      },
      {
        "date_created": "2019-03-29T03:31:27-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 646,
    "date_created": "2019-03-27T11:40:00-07:00",
    "date_updated": "2019-03-27T15:51:22-07:00",
    "title": "Folks may be unable to view all their workspaces on the Workspace Discovery page",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/a06cececed28cd96",
    "services": [
      "Login/SSO"
    ],
    "notes": [
      {
        "date_created": "2019-03-27T15:51:22-07:00",
        "body": "On March 27th from 11:40am PT until 1:55pm PT, Slack experienced an issue with the Workspace Discovery page. In particular, during this time, customers were unable to click the “Show more Workspaces” button in the Magic Link login page.\r\n\r\nAfter releasing a fix, full functionality was restored and the issue was resolved at 1:55pm PT."
      },
      {
        "date_created": "2019-03-27T13:55:00-07:00",
        "body": "We\u0027re happy to report that folks should be able to view all their workspaces on the Workspace Discovery page. We apologize for the hassle and appreciate your patience!"
      },
      {
        "date_created": "2019-03-27T11:40:00-07:00",
        "body": "We\u0027ve received word that some folks are unable to view all their workspaces on the Workspace Discovery page. We\u0027re sorry for the trouble, and we\u0027ll have an update for you soon!"
      }
    ]
  },
  {
    "id": 645,
    "date_created": "2019-03-23T13:19:39-07:00",
    "date_updated": "2019-03-25T16:09:28-07:00",
    "title": "Trouble loading Slack on Microsoft Edge",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/b20126c38b1e47c6",
    "services": [],
    "notes": [
      {
        "date_created": "2019-03-25T16:09:28-07:00",
        "body": "Issue Summary:\r\n\r\nOn March 22nd starting at 11:00am PT, some customers were unable to load Slack in Microsoft Edge browsers. This was the result of a local caching issue specific to Microsoft Edge, which exceeded local storage space on Edge browsers. Customers using other browsers were not affected. After identifying the issue, we were able to deploy a fix and users were able to load Slack once again as of 4:15pm PT on March 23rd."
      },
      {
        "date_created": "2019-03-23T16:41:39-07:00",
        "body": "Slack should now work properly in a Microsoft Edge browser. Thank you for bearing with us."
      },
      {
        "date_created": "2019-03-23T14:49:39-07:00",
        "body": "We\u0027re continuing to narrow down the problem with accessing Slack on Microsoft Edge browsers. Thank you for your patience during this process."
      },
      {
        "date_created": "2019-03-23T14:19:39-07:00",
        "body": "We don\u0027t have any updates to provide quite yet. Apologies about any trouble this has been causing to your day."
      },
      {
        "date_created": "2019-03-23T13:49:39-07:00",
        "body": "We\u0027re continuing to look into the root cause of this issue. Thank you for your patience during this process."
      },
      {
        "date_created": "2019-03-23T13:25:39-07:00",
        "body": "Some folks are having trouble loading Slack on Microsoft Edge browsers. We\u0027re investigating this issue and will be sure to relay updates once we have them."
      },
      {
        "date_created": "2019-03-23T13:19:39-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 644,
    "date_created": "2019-03-22T10:04:58-07:00",
    "date_updated": "2019-03-22T10:38:17-07:00",
    "title": "Workspace-wide Do Not Disturb issues",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/324ba5079c9529be",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-03-22T10:38:17-07:00",
        "body": "Everyone should be able to set workspace-wide Do Not Disturb hours as normal."
      },
      {
        "date_created": "2019-03-22T10:09:34-07:00",
        "body": "We\u0027ve received word that some workspaces are having trouble setting workspace-wide Do Not Disturb. We\u0027re currently investigating the issue and will have an update shortly."
      },
      {
        "date_created": "2019-03-22T10:04:58-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 643,
    "date_created": "2019-03-22T05:54:36-07:00",
    "date_updated": "2019-03-22T06:12:47-07:00",
    "title": "Issues with image loading on mobile",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/e3a5aea5758a30d5",
    "services": [
      "Posts/Files"
    ],
    "notes": [
      {
        "date_created": "2019-03-22T06:12:47-07:00",
        "body": "We\u0027re all good and images should be loading fine on mobile."
      },
      {
        "date_created": "2019-03-22T06:08:47-07:00",
        "body": "Some users may have problems loading images or image thumbnails in our mobile apps. We\u0027re looking into it."
      },
      {
        "date_created": "2019-03-22T05:54:36-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 642,
    "date_created": "2019-03-21T11:22:00-07:00",
    "date_updated": "2019-03-21T11:55:15-07:00",
    "title": "We’re looking into an issue where users are not able to join a call.",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/86d5f4600274b5a4",
    "services": [
      "Calls"
    ],
    "notes": [
      {
        "date_created": "2019-03-21T11:55:15-07:00",
        "body": "We\u0027ve got good news: we\u0027re in the clear and everyone should be able to make calls successfully again. We\u0027re sorry for any trouble this caused and thank you for sticking with us."
      },
      {
        "date_created": "2019-03-21T11:23:09-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      },
      {
        "date_created": "2019-03-21T11:22:00-07:00",
        "body": "We’ve heard reports that some people are having trouble with not being to join a call. We’re looking into it and we’ll keep you posted on any updates."
      }
    ]
  },
  {
    "id": 641,
    "date_created": "2019-03-18T13:35:58-07:00",
    "date_updated": "2019-03-18T21:36:07-07:00",
    "title": "Users unable to delete and convert channels",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/da736d5d5c099eb8",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-03-18T21:36:07-07:00",
        "body": "Issue Summary: \r\n\r\nOn March 18th from 12:22pm PDT, attempts to convert public channels to private were failing for all workspaces. Additionally, attempts to delete these channels also failed. We identified the cause and a fix was deployed at 2:10pm PDT to convert the affected channels to private. After further monitoring, we called the all clear on March 18th at 6:08pm PDT. We’re investigating the root cause, as well as making plans to ensure this doesn’t happen in the future."
      },
      {
        "date_created": "2019-03-18T18:11:34-07:00",
        "body": "We\u0027ve fixed the issues with converting and deleting channels. Thanks for bearing with us and we\u0027ll be at feedback@slack.com if you need more help."
      },
      {
        "date_created": "2019-03-18T16:15:19-07:00",
        "body": "No new information to share just yet, thanks for sticking with us. We will share additional updates as they come in."
      },
      {
        "date_created": "2019-03-18T15:35:36-07:00",
        "body": "We really appreciate you sticking with us. We know this is a big disruption to your day, so we\u0027ve got all eyes working to fix the issue."
      },
      {
        "date_created": "2019-03-18T15:05:02-07:00",
        "body": "We have no new information to share just yet, but we\u0027re continuing our efforts. We truly appreciate your patience."
      },
      {
        "date_created": "2019-03-18T14:35:45-07:00",
        "body": "Nothing new to share just yet, but we\u0027re working to get things back to normal as soon as possible. Again, we truly appreciate your patience."
      },
      {
        "date_created": "2019-03-18T14:05:22-07:00",
        "body": "We don\u0027t have any further updates right now, but thank you for your patience while we continue to investigate."
      },
      {
        "date_created": "2019-03-18T13:35:58-07:00",
        "body": "Users are experiencing troubles deleting and converting channels. Our team is getting to the bottom if it."
      }
    ]
  },
  {
    "id": 640,
    "date_created": "2019-03-17T19:59:40-07:00",
    "date_updated": "2019-03-17T21:42:39-07:00",
    "title": "Recent messages not shown in search results",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/baf0a6fe3bba88bb",
    "services": [
      "Search"
    ],
    "notes": [
      {
        "date_created": "2019-03-17T21:42:39-07:00",
        "body": "Issue Summary:\r\n\r\nOn March 17th at 6:29pm PDT, we received a report that the search feature was not returning the most recently posted messages. An internal investigation was launched.\r\n\r\nWe established that this was caused by a change made to the search infrastructure tooling at 5:00pm PDT. This resulted in search indexing failing to return messages posted after this change. Once this was identified, we were able to deploy a fix and resolve the issue at 8:37pm PDT on March 17th.\r\n\r\nWe’re investigating the root cause, as well as making plans to ensure this doesn’t happen in the future."
      },
      {
        "date_created": "2019-03-17T20:37:46-07:00",
        "body": "Recent messages should be appearing once again in your search results. Sorry for the hassle and thanks for sticking with us!"
      },
      {
        "date_created": "2019-03-17T19:59:40-07:00",
        "body": "Recent messages may not be listed in search results at the moment. We are investigating, and we\u0027re very sorry for the disruption. Thank you for your patience."
      }
    ]
  },
  {
    "id": 638,
    "date_created": "2019-03-13T12:38:48-07:00",
    "date_updated": "2019-03-17T18:57:29-07:00",
    "title": "Issues with starting and opening Direct Messages for some users",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/228756e606fc63fa",
    "services": [],
    "notes": [
      {
        "date_created": "2019-03-17T18:57:29-07:00",
        "body": "Issue Summary:\r\n\r\nAt 11:40 AM PDT on March 13, we made a code change that caused users to be unable to start a new DM from the “Direct Messages” menu on their channel sidebar. After identifying the issue, this change was rolled back for all users at 1:10 PM PDT and access to this menu was restored. Access to Direct Messages from the Quick Switcher and from usernames in the channel sidebar was unaffected during this period."
      },
      {
        "date_created": "2019-03-13T13:10:44-07:00",
        "body": "Full functionality for Direct Messages should be restored for all users! Please reload Slack for the fix to take effect."
      },
      {
        "date_created": "2019-03-13T12:38:48-07:00",
        "body": "We\u0027ve received word that some users are experiencing reduced functionality with Direct Messages. We\u0027re investigating!"
      }
    ]
  },
  {
    "id": 639,
    "date_created": "2019-03-13T17:38:23-07:00",
    "date_updated": "2019-03-15T07:25:20-07:00",
    "title": "Team members appearing offline inaccurately",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/d2ba856af2b3f45c",
    "services": [],
    "notes": [
      {
        "date_created": "2019-03-15T07:25:20-07:00",
        "body": "Users should now appear online correctly for the rest of their team. We apologize for any confusion this may have caused! If you\u0027re still having troubles, please let us know at feedback@slack.com"
      },
      {
        "date_created": "2019-03-15T01:54:20-07:00",
        "body": "Issue Summary:\r\n\r\nOn March 13th at 10:00am PT, some users were seeing the availability of their teammates incorrectly showing as “away”, even though they were online and actively using Slack. This issue affected some users located in various regions of APAC.\r\n\r\nA recent deploy had introduced errors that were causing connection issues linked to user availability. Once this was identified, we rolled out a fix. After receiving confirmation from affected users, the issue was officially resolved as of 7:30am PT on March 15th."
      },
      {
        "date_created": "2019-03-13T23:09:17-07:00",
        "body": "While we\u0027re still working towards a complete resolution, team members will now appear online correctly for some customers. We appreciate you bearing with us."
      },
      {
        "date_created": "2019-03-13T17:38:23-07:00",
        "body": "Some team members may be appearing offline inaccurately. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 637,
    "date_created": "2019-03-12T19:11:37-07:00",
    "date_updated": "2019-03-14T20:41:11-07:00",
    "title": "Member list not displaying in newly created channels",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/a4c0ebd702d5f377",
    "services": [],
    "notes": [
      {
        "date_created": "2019-03-14T20:41:11-07:00",
        "body": "Issue Summary: \r\n\r\nOn March 12th around 5:30 PM PST, we became aware of an issue where users added to new channels were not able to view the list of members within that channel.\r\n\r\nThis was due to a caching bug discovered by our engineering team, who deployed a fix for this at 8:30 PM PST on March 13th. We\u0027ve determined the root cause of this issue and made further changes to ensure this doesn\u0027t happen again. Please let us know if you require further assistance through feedback@slack.com."
      },
      {
        "date_created": "2019-03-13T20:42:00-07:00",
        "body": "Good news! Members are appearing again in newly created channels. We\u0027re sorry for any trouble this caused. Thanks for sticking with us."
      },
      {
        "date_created": "2019-03-13T17:00:54-07:00",
        "body": "We\u0027re continuing to investigate this issue. We\u0027ll report back as soon as this has been resolved! Thank you for your patience in the meantime."
      },
      {
        "date_created": "2019-03-12T19:11:37-07:00",
        "body": "We\u0027ve seen reports that members are not displayed in the Channel Details sidebar in newly created channels. We’re looking into it as we speak. Thanks for your patience."
      }
    ]
  },
  {
    "id": 636,
    "date_created": "2019-03-12T10:33:30-07:00",
    "date_updated": "2019-03-12T17:11:17-07:00",
    "title": "Org Dashboard is not loading for Grid customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/b0cf75e2eb829bf2",
    "services": [
      "Workspace/Org Administration"
    ],
    "notes": [
      {
        "date_created": "2019-03-12T17:11:17-07:00",
        "body": "Issue Summary:\r\n\r\nOn March 12 at 9:48 AM PDT, we rolled out a change that caused the Org Dashboard to stop loading for Enterprise Grid customers. As a result, Org Admins and Owners were unable to make administrative changes. After investigating the problem, we reverted the change, which successfully returned functionality of this page at 11:44 AM PDT."
      },
      {
        "date_created": "2019-03-12T11:34:01-07:00",
        "body": "A fix has been deployed, however some customers may need to reload Slack by hitting SHIFT + CTRL(Win)/CMD(Mac) + R. Thank you for your patience."
      },
      {
        "date_created": "2019-03-12T11:10:48-07:00",
        "body": "We are happy to report Org Dashboards are back up and running! Apologies for the disruption to your day."
      },
      {
        "date_created": "2019-03-12T10:42:56-07:00",
        "body": "The Org Dashboard is not loading for some Grid customers. We are working hard to get it back up and running. Thank you for your patience!"
      },
      {
        "date_created": "2019-03-12T10:33:30-07:00",
        "body": "Some people may be having an issue with Slack. We’re currently investigating and will have more information shortly. Thank you for your patience."
      }
    ]
  },
  {
    "id": 635,
    "date_created": "2019-03-06T11:43:40-08:00",
    "date_updated": "2019-03-06T22:18:44-08:00",
    "title": "Issues with File Uploads for some workspaces",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/6664476f2e70e99a",
    "services": [
      "Posts/Files"
    ],
    "notes": [
      {
        "date_created": "2019-03-06T22:18:44-08:00",
        "body": "Issue Summary:\r\n\r\nOn March 6th at 8:30 AM PST and again at 10:40 AM PST, we removed two feature flags that caused file uploads to fail for some customers. Upon investigation, we identified the problematic flags and began reverting this change. All file upload functionality was restored by 12:33 PM PST."
      },
      {
        "date_created": "2019-03-06T12:38:11-08:00",
        "body": "File uploads should be working properly once again for all workspaces! Let us know at feedback@slack.com if any issues persist after a reload."
      },
      {
        "date_created": "2019-03-06T12:13:35-08:00",
        "body": "We\u0027re still working to fix file uploads, but some users are reporting success with uploads after refreshing Slack. Thank you for your patience in the meantime!"
      },
      {
        "date_created": "2019-03-06T11:43:40-08:00",
        "body": "We\u0027re investigating issues with file uploads for some workspaces. We apologize for the inconvenience in the meantime."
      }
    ]
  },
  {
    "id": 634,
    "date_created": "2019-03-05T16:39:26-08:00",
    "date_updated": "2019-03-05T23:40:30-08:00",
    "title": "Domain-based workspace signup is failing for all customers",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-03/dce3c87b548ff0a9",
    "services": [
      "Login/SSO"
    ],
    "notes": [
      {
        "date_created": "2019-03-05T23:40:30-08:00",
        "body": "Issue Summary: \r\n\r\nOn March 5th at 2:28 PM PT we removed a feature flag aimed at improving the signup experience. Unfortunately, this introduced a bug in our signup flow which caused domain-based signup to fail for all users. At 2:51 PM PT, we began receiving customer reports of this issue. By 6:02 PM PT, we had identified the bug and reverted the change, which restored full functionality to domain-based signup mode."
      },
      {
        "date_created": "2019-03-05T18:04:14-08:00",
        "body": "We\u0027ve been given the all-clear. Domain-based signup should be working for everyone once more. We really appreciate you sticking with us through that. Apologies for all that hassle."
      },
      {
        "date_created": "2019-03-05T17:40:28-08:00",
        "body": "Things are looking positive though we\u0027re still working to get to the bottom of this trouble with domain signup. Thanks again for your patience through this."
      },
      {
        "date_created": "2019-03-05T17:10:47-08:00",
        "body": "We’re still working on getting to the bottom of this. In the meantime, you should be able to join a workspace or invite people to a workspace by using a direct invite."
      },
      {
        "date_created": "2019-03-05T16:39:26-08:00",
        "body": "We\u0027re investigating why domain-based signups are not working correctly. Apologies for this disruption to your day."
      }
    ]
  },
  {
    "id": 625,
    "date_created": "2019-02-19T16:29:24-08:00",
    "date_updated": "2019-03-05T23:38:34-08:00",
    "title": "Trouble with sending messages",
    "type": "incident",
    "status": "resolved",
    "url": "https://status.slack.com/2019-02/6f76cbee0127cc14",
    "services": [
      "Messaging"
    ],
    "notes": [
      {
        "date_created": "2019-03-05T23:38:34-08:00",
        "body": "Issue Summary: \r\n\r\nOn February 19th at 3:00PM PT, we deployed a change to one of our core systems. At 3:03PM PT we received internal warnings that this change had caused elevated error rates in message sending and began investigating. By 4:39PM PT we had resolved the issue and all messages were sending as expected."
      },
      {
        "date_created": "2019-02-19T16:59:54-08:00",
        "body": "The team have been monitoring things and have given us the all-clear. If you are still experiencing issues with message delivery please let us know at feedback@slack.com. So sorry for all this hassle."
      },
      {
        "date_created": "2019-02-19T16:29:24-08:00",
        "body": "We\u0027re investigating why some people are having issues sending messages. Apologies for this disruption."
      }
    ]
  }
]